Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: Hardware requirements highly depend on the usage of OTOBO. OTOBO can be used to process a few tickets per month or to process hundreds of tickets per day. The storage requirement also depends on the number of tickets and size of attachments.
de: Die Hardware-Anforderungen sind weitgehend davon abhängig, wie OTOBO genutzt wird. Mit OTOBO können wenige Tickets pro Monat oder mehrere Tickets pro Tag verarbeitet werden. Die Anforderungen an den Speicherplatz hängen ebenfalls von der Anzahl der Tickets und der Größe der Anlagen ab.

source: We recommend using a machine for testing purposes with **at least**:
de: **Mindestanforderungen** für den Testbetrieb:

source: small CPU
de: kleine CPU

source: 10 GB storage
de: 10 GB Speicher

source: We recommend using a machine for production purpose with **at least**:
de: **Mindestanforderungen** für den Produktivbetrieb:

source: 3 GHz Xeon or comparable CPU
de: 3 GHz Xeon oder vergleichbare CPU

source: 8 GB RAM (16 GB recommend)
de: 8 GB RAM (16 GB empfohlen)

source: 40 GB storage
de: 40 GB Speicher

source: Hardware requirements depend on the usage of OTOBO. Please contact your OTOBO consultant before deploying any hardware.
de: Hardware-Anforderungen variieren stark und ergeben sich aus den individuellen Einsatzszenarien. Bitte lassen Sie sich von Ihrem OTOBO Consultant beraten.

source: Software requirements
de: Software-Anforderungen

source: Perl 5.24.0 or higher
de: Perl 5.24.0 oder höher

source: Perl packages listed by ``/opt/otobo/bin/otobo.CheckModules.pl --list`` console command
de: Alle Perl-Pakete, die vom Konsolebefehl ``/opt/otobo/bin/otobo.CheckModules.pl`` ausgegeben werden

source: Databases
de: Datenbanken

source: MySQL 5.6 or higher
de: MySQL 5.6 oder höher

source: PostgreSQL 9.2 or higher
de: PostgreSQL 9.2 oder höher

source: Oracle 10g or higher
de: Oracle 10g oder höher

source: Elasticsearch 7.x (fast search function for live previews)
de: Elasticsearch 7.x (Schnellsuche mit Live-Preview)

source: Redis (fast caching)
de: Redis (schnelles Caching)

source: nginx or any other web server that can be used as a reverse proxy (SSL support and load distribution)
de: nginx oder jeder andere Webserver, der als Reverseproxy eingesetzt werden kann (SSL-Unterstützung und Lastverteilung)

source: Web browsers
de: Webbrowser

source: Microsoft Internet Explorer 11
de: Microsoft Internet Explorer 11 (nutzbar, bietet aber nicht den vollen Funktionsumfang und alle GUI-Aspekte)

source: Any other modern web browser with JavaScript support
de: Jeder andere moderne Webbrowser mit JavaScript-Unterstützung

source: Kerberos Single Sign On in OTOBO Docker installation
de: Kerberos Single Sign On in der OTOBO Docker-Installation

source: Please read to the chapter :doc:`installation-docker` for basic information about installing and configure OTOBO. This tutorial assumes that OTOBO has been installed and configured using Docker.
de: Bitte lesen Sie das Kapitel :doc:`installation-docker` für grundlegende Informationen über die Installation und Konfiguration von OTOBO. Dieses Tutorial geht davon aus, dass OTOBO mit Docker installiert und konfiguriert wurde.

source: In the following, we will refer from AD (Active Directory), of course the Kerberos configuration is also possible under LDAP.
de: Im Folgenden sprechen wir von AD (Active Directory). Natürlich funktioniert die Konfiguration von Kerberos auch mit LDAP.

source: Generate Active Directory User
de: Active Directory User erstellen

source: Please create a new Active Directory User with the following settings and save the marked settings:
de: Bitte erstellen Sie einen neuen Active Directory Benutzer mit den folgenden Einstellungen und speichern Sie die markierten Einstellungen:

source: The password doesn't work properly with some special characters (e.g. '&').
de: Das Passwort funktioniert nicht zuverlässig mit einigen Sonderzeichen (z.B. '&').

source: You have to create a seperate AD-user. You can not use the one that you already use for your LDAP/AD sync.
de: Sie müssen einen separaten AD-Benutzer anlegen. Sie können nicht jenen benutzen, den Sie bereits für Ihre LDAP/AD-Synchronisation verwenden.

source: Generate Active Directory Keytab file
de: Active Directory Keytab-Datei erstellen

source: Please write the domain (@OTRS.LOCAL) always in capital letters. The password must not contain some special characters.
de: Bitte schreiben Sie die Benutzernamen (@OTRS.LOCAL) immer in Großbuchstaben. Das Passwort darf einige Sonderzeichen nicht enthalten.

source: In the next step please move the krb5.keytab file to the OTOBO Server:
de: Im nächsten Schritt verschieben Sie bitte die Datei krb5.keytab auf den OTOBO-Server:

source: Create new OTOBO .env file
de: Neue OTOBO .env*-Datei anlegen

source: # Kerberos Service Name OTOBO_NGINX_KERBEROS_SERVICE_NAME=HTTP/otrs32-centos6.otrs.local # -> Picture Number 1
de: # Kerberos Service Name OTOBO_NGINX_KERBEROS_SERVICE_NAME=HTTP/otrs32-centos6.otrs.local # -> Bild Nummer 1

source: # Kerberos REALM OTOBO_NGINX_KERBEROS_REALM=ROTHER-OSS.COM -> OTRS.LOCAL # -> Picture Number 2
de: # Kerberos REALM OTOBO_NGINX_KERBEROS_REALM=ROTHER-OSS.COM -> OTRS.LOCAL # -> Bild Nummer 2

source: Start OTOBO
de: OTOBO starten

source: After the initial Kerberos configuration we start OTOBO again:
de: Nach der initialen Konfiguration von Kerberos starten wir OTOBO erneut:

source: Tell OTOBO to use the Kerberos-Authentication
de: In OTOBO angeben, dass die Kerberos-Authentifizierung verwendet werden soll

source: Configure Browser to understand Kerberos SSO
de: Den Browser so konfigurieren, dass er Kerberos SSO versteht

source: For SSO to work, the browser must be configured accordingly.
de: Damit SSO funktioniert, muss der Browser entsprechend konfiguriert werden.

source: Add page under local or trusted pages and activate 'Integrated Windows Authentication' (Internet Options).
de: Fügen Sie eine Seite unter „Lokale oder vertrauenswürdige Seiten“ hinzu und aktivieren Sie „Integrierte Windows-Authentifizierung“ (Internetoptionen).

source: Enter "about:config" in the firefox address line
de: "about:config" in die Adresszeile von Firefox eingeben

source: and change the following settings:
de: und folgende Einstellungen anpassen:

source: Debugging and Problems
de: Fehlererkennung und Problembehebung

source: If the Kerberos SSO does not work, please check first if the NGINX container is started:
de: Sollte das Kerberos SSO nicht funktionieren, überprüfen Sie bitte zunächst, ob der NGINX-Container gestartet ist:

source: In the next step please check the NGINX logs for more information:
de: Im nächsten Schritt überprüfen Sie bitte die NGINX-Logs auf mehr Informationen:

source: If NGINX is running, please login into the NGINX Container and check all needed files:
de: Sollte NGINX laufen, loggen Sie sich bitte in den NGINX-Container ein und überprüfen Sie alle benötigten Dateien:

source: Kerberos debugging
de: Kerberos Fehlerbehebung

source: Now you are able to debug the Kerberos settings. Examples:
de: Nun sind Sie in der Lage, die Kerberos-Einstellungen auf Fehler zu überprüfen. Beispiele:

source: In case you stumble upon the issue that apparently the authentication works but the agent is not yet in the database, then your sync (if implemented) might not work. An error 52e (First bind failed) indicates that something is wrong with your Search User. This happens if you use the same user for the AD sync and as a SSO user. Please use seperate AD users for that. In order to not have to create a new keytab and having to repeat the steps mentioned above, it could be easier to create a new user to use in your AD sync (probably in your Kernel/Config.pm).
de: Falls Sie auf das Problem stoßen, dass die Authentifizierung scheinbar funktioniert, der Agent aber noch nicht in der Datenbank ist, funktioniert Ihre Synchronisierung (falls implementiert) möglicherweise nicht. Ein Fehler 52e (Erste Bindung fehlgeschlagen) weist darauf hin, dass mit Ihrem Suchbenutzer etwas nicht stimmt. Dies passiert, wenn Sie denselben Benutzer für die AD-Synchronisierung und als SSO-Benutzer verwenden. Bitte verwenden Sie hierfür separate AD-Benutzer. Um nicht eine neue Schlüsseltabelle erstellen und die oben genannten Schritte wiederholen zu müssen, könnte es einfacher sein, einen neuen Benutzer zur Verwendung in Ihrer AD-Synchronisierung zu erstellen (wahrscheinlich in Ihrer Kernel/Config.pm).

source: Updating
de: Updates

source: It is highly recommended to perform a test update on a separate testing machine first.
de: Es wird dringend empfohlen, zuerst ein Test-Update auf einem separaten Testsystem durchzuführen.

source: On Debian systems you may need to manually install some perl packages before upgrading from 10.0 to 10.1
de: Auf Debian-System kann es erforderlich sein, dass man einige perl-Pakete manuell installieren muss, bevor man von 10.0 auf 10.1 upgraden kann

source: Step 1: Stop All Relevant Services and the OTOBO Daemon
de: Schritt 1: Alle relevanten Dienste und den OTOBO Daemon stoppen

source: Please make sure there are no more running services or cron jobs that try to access OTOBO. This will depend on your service configuration.
de: Stellen Sie sicher, dass keine Dienste oder Cronjobs mehr aktiv sind und auf OTOBO zugreifen möchten. Hierfür ist ausschlaggebend, wie Ihre Dienste konfiguriert sind.

source: Stop OTOBO cron jobs and the daemon (in this order):
de: Stoppen Sie alle OTOBO Cron Jobs und den Daemon (in dieser Reihenfolge):

source: Step 2: Backup Files and Database
de: Schritt 2: Dateien und Datenbank sichern

source: Create a backup of the hole ``/opt/otobo`` directory and the database.
de: Erstellen Sie ein Backup des gesamten ``/opt/otobo``-Verzeichnis sowie der Datenbank.

source: Example for a standard installation with Ubuntu and MySQL
de: Beispiel für eine Standardinstallation mit Ubuntu und MySQL

source: Please check if all files are valid. Now we have a backup with all required data.
de: Stellen Sie sicher, dass alle Dateien valide sind. Sie haben nun ein Backup mit allen benötigten Daten.

source: Don't proceed without a complete backup of your system. You can use also the :ref:`backup-restore` script for this.
de: Fahren Sie nicht ohne eine vollständige Sicherung Ihres Systems fort. Sie können dazu auch das Skript :ref:`backup-restore` verwenden.

source: Step 3: Install the New Release
de: Schritt 3: Neues Release installieren

source: Download the latest otobo release from https://ftp.otobo.org/pub/otobo/. and unpack the source archive (for example, using ``tar``) into the directory ``/root/otobo-update``:
de: Laden Sie unter https://ftp.otobo.org/pub/otobo/ das neueste OTOBO-Release herunter und entpacken Sie das Quell-Archiv (zum Beispiel mit ``tar``) in das Verzeichnis ``/root/otobo-update``:

source: Restore Old Configuration Files
de: Alte Konfigurationsdateien wiederherstellen

source: We need only copy the file ``Kernel/Config.pm`` in OTOBO 10.
de: In OTOBO 10 reicht es aus, die Datei ``Kernel/Config.pm``zu kopieren.

source: Restore Article Data
de: Artikeldaten wiederherstellen

source: If you configured OTOBO to store article data in the file system you have to restore the ``article`` folder to ``/opt/otobo/var/`` or the folder specified in the system configuration.
de: Wenn Sie OTOBO so konfiguriert haben, dass Artikeldaten im Dateisystem gespeichert werden, müssen Sie den Ordner ``article`` in ``/opt/otobo/var/`` (oder in dem in der Systemkonfiguration angegebenen Ordner) wiederherstellen.

source: Restore Already Installed Default Statistics
de: Bereits installierte Standardstatistiken wiederherstellen

source: If you have additional packages with default statistics you have to restore the stats XML files with the suffix ``*.installed`` to ``/opt/otobo/var/stats``.
de: Wenn Sie zusätzliche Pakete mit Standardstatistiken haben, müssen Sie die XML-Statistikdateien mit dem Suffix ``*.installed`` in ``/opt/otobo/var/stats`` wiederherstellen.

source: Set File Permissions
de: Dateiberechtigungen anpassen

source: Check Apache configuration files
de: Apache-Konfigurationsdateien überprüfen

source: Step 4: Check for new needed perl modules
de: Schritt 4: Überprüfung auf neu benötigte perl-Module

source: OTOBO needs new cpan packages for some version jumps. Please check if new packages are needed and install them if necessary.
de: OTOBO benötigt für einige Versionssprünge neue CPAN-Pakete. Bitte prüfen Sie, ob neue Pakete benötigt werden und installieren Sie diese gegebenenfalls.

source: On Debian systems you may need to manually install some packages:
de: Auf Debian-Systemen kann es notwendig sein, einige Pakete manuell zu installieren:

source: Step 5: Update Installed Packages and reconfigure config
de: Schritt 5: Aktualisieren bereits installierter Pakete und Konfiguration neukonfigurieren

source: You can use the command below to update all installed packages. This works for all packages that are available from online repositories. You can update other packages later via the package manager (this requires a running OTOBO daemon).
de: Sie können den folgenden Befehl verwenden, um alle installierten Pakete zu aktualisieren. Dies funktioniert für alle Pakete, die in Online-Repositorys verfügbar sind. Alle anderen Pakete können Sie später über den Paketmanager aktualisieren (dies erfordert einen laufenden OTOBO-Daemon).

source: Step 6: Only for minor or major release upgrades (for example to upgrade from 10.0 to 10.1)
de: Schritt 6: Nur für Minor- oder Major-Release-Upgrades (zum Beispiel für ein Upgrade von 10.0 auf 10.1)

source: Step 7: Start your Services
de: Schritt 7: Dienste starten

source: Start OTOBO cron jobs and the daemon (in this order):
de: Starten Sie OTOBO Cron Jobs und den Daemon (in dieser Reihenfolge):

source: Now the services can be started. This will depend on your service configuration, here is an example:
de: Jetzt können die Dienste wieder gestartet werden. Wie genau vorzugehen ist, hängt von deren Konfiguration ab. Ein Beispiel:

source: Now you can log into your system.
de: Jetzt können Sie sich an Ihrem System anmelden.

source: Updating a Docker-based Installation of OTOBO
de: Aktualisieren einer Docker-basierte OTOBO-Installation

source: For running OTOBO under Docker we need the OTOBO software itself and an environment in which OTOBO can run. The OTOBO Docker image provides the environment and a copy of the OTOBO software. The software itself is installed in the volume *otobo_opt_otobo*. A named volume is used because run time data, e.g. configuration files and installed packages, is stored in the same directory tree.
de: Für eine Docker-basierte OTOBO-Umgebung wird OTOBO selbst sowie eine Umgebung benötigt, in der die Software ausgeführt werden kann. Das OTOBO Docker Image stellt die Umgebung sowie eine Kopie der OTOBO-Software bereit. Die Software selbst wird im Volume *otobo_opt_otobo* installiert. Das Volume hat deshalb einen Namen, weil alle Laufzeitdaten, z. B. Konfigurationsdateien und installierte Pakete, im selben Verzeichnisbaum gespeichert werden.

source: When updating to a new version of OTOBO several things have to happen.
de: Beim Update auf eine neue OTOBO-Version müssen verschiedene Dinge geschehen.

source: The Docker Compose files have to be updated.
de: Die Docker Compose Dateien müssen aktualisiert werden.

source: The Docker Compose config file *.env* has to be checked.
de: Die Docker Compose Konfig-Datei *.env* muss überprüft werden.

source: The new Docker image has to be fetched.
de: Das neue Docker-Image muss abgerufen werden.

source: The volume *otobo_opt_otobo* must be updated.
de: Das Volume *otobo_opt_otobo* muss aktualisiert werden.

source: Some maintainance tasks must be executed.
de: Einige Wartungsaufgaben sind auszuführen.

source: In the sample commands below, the version **10.x.y**, corresponding to the tag **10_x_y**, is used as the example version. Please substitute it with the real version, e.g. **10.0.7**.
de: In den Beispielbefehlen unten wird beispielhaft die Version **10.x.y** und damit das Tag **10_x_Y** verwendet. Bitte tragen Sie stattdessen die jeweils aktuelle Version ein – z. B. **10.0.7**.

source: These instructions apply only to OTOBO 10.0.6 or later.
de: Die im folgenden beschriebene Anleitung gilt ab OTOBO Version 10.0.6.

source: Updating the Docker Compose files
de: Docker Compose-Dateien aktualisieren

source: The OTOBO Docker Compose files can change between releases. Therefore is must be made sure that the correct setup is used.
de: Die OTOBO Docker Compose-Dateien wechseln von Release zu Release. Achten Sie deshalb darauf, jeweils das richtige Setup zu verwenden.

source: Checking the Docker Compose .env file
de: Docker Compose .env-Datei überprüfen

source: The file *.env* controls the OTOBO Docker container. Within that file, the variables *OTOBO_IMAGE_OTOBO*, *OTOBO_IMAGE_OTOBO_ELASTICSEARCH*, and *OTOBO_IMAGE_OTOBO_NGINX* declare which images are used. The latest images are used when these variables are not set. If you want to use a specific version, then please set these variables accordingly.
de: Die *.env*-Datei kontrolliert den OTOBO Docker Container. In dieser Datei wird über die Variablen *OTOBO_IMAGE_OTOBO*, *OTOBO_IMAGE_OTOBO_ELASTICSEARCH* und *OTOBO_IMAGE_OTOBO_NGINX* festgelegt, welche Images verwendet werden. Ist kein spezifischer Wert für die Variablen angegeben, wird jeweils das neueste Image verwendet. Möchten Sie eine spezifische Version verwenden, fügen Sie diese hier ein.

source: Fetch the new Docker images
de: Docker Images abrufen

source: Update OTOBO
de: OTOBO aktualisieren

source: In this step the volume *otobo_opt_otobo* is updated and the following OTOBO console commands are performed:
de: In diesem Schritt wird das Volume *otobo_opt_otobo* aktualisiert und folgende OTOBO Kommandozeilenbefehle ausgeführt:

source: The above listed commands can be automated. For that purpose the script *scripts/update.sh* will be made available in OTOBO 10.0.8. This script runs the commands, starting with the **docker-compose pull** command.
de: Die vorstehenden Befehle können automatisiert werden. Zu diesem Zweck wird mit OTOBO 10.0.8 das Skript *scripts/update.sh* zur Verfügung gestellt. Dieses Skript führt die Befehle ab **docker-compose pull** aus.
