Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: First of all, you should install the Apache2 web server and mod_perl; you'd typically do this from your system's package manager. Below you'll find the commands needed to set up Apache on the most popular Linux distributions.
de: Installieren Sie zunächst den Apache2-Webserver und mod_perl. In der Regel nutzen Sie hierzu die Paketverwaltung Ihres Systems. Nachstehend finden Sie alle Befehle, die Sie benötigen, um Apache in den gängigsten Linux-Distributionen aufzusetzen.

source: A critical setting of the Apache web server is the choice of the multi-processing module. For running OTOBO, the recommended choice is the module **mpm_prefork**. Like other Apache modules the multi-processing module can be managed with the tools a2dismod and a2enmod.
de: Zentrale Bedeutung hat die Auswahl des Multi-Processing-Modules (MPM). Für den OTOBO-Betrieb empfehlen wir das Modul **mpm_prefork**. Wie andere Apache-Module kann auch das MPM-Modul mit den Tools a2dismod und a2enmod verwaltet werden.

source: All is fine whem mpm_prefork already is enabled.
de: Möglicherweise ist mpm_prefork bereits vorausgewählt. Dann kann dieser Schritt übersprungen werden.

source: Disable mpm_event when it is currently active.
de: Deaktivieren Sie mpm_event, falls das Modul aktiv ist.

source: Disable mpm_worker in case that MPM is enabled.
de: Deaktivieren Sie mpm.worker, falls dieses MPM aktiv ist.

source: Finally activate mpm_prefork.
de: Und aktivieren Sie schließlich mpm_prefork.

source: OTOBO requires a few more Apache modules to be active for optimal operation. Again, on most platforms you can make sure they are active via the tool a2enmod.
de: Damit OTOBO optimal funktioniert, müssen weitere Apache-Module aktiv sein. Auch deren Status können Sie auf den meisten Systemen mit dem Tool a2enmod prüfen.

source: On some platforms not all Apache modules exist and an error is displayed when installing. Do not worry and finish the installation, in most cases the module will not be needed.
de: Auf manchen Systemen sind nicht alle Apache-Module vorhanden, dann wird während der Installation eine Fehlermeldung ausgegeben. Fahren Sie einfach mit der Installation fort. In den meisten Fällen werden die fehlenden Module nicht benötigt.

source: Most Apache installations have a ``conf.d`` directory included. On Linux systems you can usually find this directory under ``/etc/apache`` or ``/etc/apache2``.
de: In den meisten Apache-Installationen findet sich ein Verzeichnis ``conf.d``. Auf Linux-Systemen finden Sie es in aller Regel unter ``/etc/apache`` oder ``/etc/apache2``.

source: Configure Apache without SSL support
de: Apache ohne SSL-Unterstützung konfigurieren

source: Copy the template file ``/opt/otobo/scripts/apache2-httpd.include.conf`` to the apache ``sites-available`` directory. In most cases no further editing of the template is required. Then enable the new configuration.
de: Kopieren Sie die Vorlage ``/opt/otobo/scripts/apache2-httpd.include.conf`` in das Apache-Verzeichnis ``sites-available``. In den meisten Fällen muss die Vorlage nicht weiter angepasst werden. Aktivieren Sie die neue Konfiguration.

source: Configure Apache **with** SSL support
de: Apache **mit** SSL-Unterstützung kofigurieren

source: Copy the template files ``/opt/otobo/scripts/apache2-httpd-vhost-80.include.conf`` and ``/opt/otobo/scripts/apache2-httpd-vhost-443.include.conf`` to the apache ``sites-available`` directory.
de: Kopieren Sie die Vorlagen ``/opt/otobo/scripts/apache2-httpd-vhost-80.include.conf`` und ``/opt/otobo/scripts/apache2-httpd-vhost-443.include.conf`` in das Apache-Verzeichnis ``sites-availible``.

source: Please edit the files and add the required information like SSL certificate storage path. After that, enable the OTOBO Apache configuration:
de: Bearbeiten Sie die Dateien und ergänzen Sie die benötigten Informationen wie den Pfad zum SSL-Zertifikat. Anschließend aktivieren Sie die OTOBO-Apache-Konfiguration:

source: Now you can restart your web server to load the new configuration settings. On most systems you can use the following command to do so:
de: Jetzt können Sie Ihren Webserver neu starten und die neuen Konfigurationseinstellungen laden. Auf den meisten Systemen gelingt dies mit folgendem Befehl:

source: Step 6: Set File Permissions
de: Schritt 6: Dateiberechtigungen anpassen

source: Please execute the following command to set the file and directory permissions for OTOBO. It will try to detect the correct user and group settings needed for your setup.
de: Führen Sie folgenden Befehl aus, um die Datei- und Verzeichnis-Berechtigungen für OTOBO zu definieren. Es wird versucht, die passenden Benutzer- und Gruppeneinstellungen für Ihr Setup zu ermitteln.

source: Step 7: Setup the Database
de: Schritt 7: Datenbank anlegen

source: First of all, you should install the database package. It is recommended to use the MySQL or MariaDB package, which will be delivered with your Linux system, but it is possible to use PostgreSQL or Oracle as well.
de: Installieren Sie zuerst das Datenbank-Paket. Wir empfehlen, das mit Ihrem Linuxsystem zur Verfügung gestellte MySQL- oder MariaDB-Paket zu verwenden. Sie können aber auch PostgreSQL oder Oracle nutzen.

source: You'd typically do this from your systems package manager. Below you'll find the commands needed to set up MySQL on the most popular Linux distributions.
de: In aller Regel erfolgt die Installation wieder über die Paketverwaltung Ihres Systems. Nachstehend finden Sie die zum Aufsetzen von MySQL in den gängigsten Linux-Distributionen benötigten Befehle.

source: After installing the MySQL server you need configure it.
de: Nach der Installation muss der MySQL-Server konfiguriert werden.

source: In MySQL higher or equal version 5.7 a new authentication module is active, and it is not possible to use the OTOBO web installer for database creation. Please login to the mysql console and set a different authentication module and password for the user ``root`` if this is the case:
de: In MySQL ab Version 5.7 ist ein neues Authentifizierungsmodul aktiv, das ein Anlegen der Datenbank durch den OTOBO Web Installer verhindert. Bitte loggen Sie sich in diesem Fall in die MySQL-Konsole ein und definieren Sie ein anderes Authentifizierungsmodul und ein Passwort für den ``root``-Benutzer:

source: For MariaDB > 10.1 use instead the following command:
de: Für MariaDB > 10.1 verwenden Sie stattdessen folgenden Befehl:

source: If this command not work, please try the following commands:
de: Funktioniert dieser Befehl nicht, versuchen Sie es mit folgenden Kommandos:

source: After OTOBO installation it is possible to change the authentication module again, if needed.
de: Sofern nötig, können Sie das Authentifizierungsmodul nach der OTOBO-Installation wieder ändern.

source: The following configuration settings are minimum requirements for MySQL setups. Please add the following lines to the MySQL Server configuration file ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` or ``/etc/mysql/mysql.conf.d/mysqld.cnf`` under the ``[mysqld]`` section:
de: Folgende Konfigurationseinstellungen beschreiben die Minimalanforderungen für MySQL. Bitte ergänzen Sie die MySQL-Server-Konfigurationsdatei unter ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` oder ``/etc/mysql/mysql.conf.d/mysqld.cnf`` im Abschnitt ``[mysqld]`` um diese Zeilen:

source: For MySQL prior to MySQL 8.0 the query cache size should also be set:
de: Für MySQL-Versionen vor MySQL 8.0 sollten Sie außerdem den Query-Cache definieren:

source: Also add the following lines to the MySQL Server configuration file ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` or ``/etc/mysql/mysql.conf.d/mysqldump.cnf`` under the ``[mysqldump]`` section:
de: Bitte ergänzen Sie die MySQL-Server-Konfigurationsdatei unter ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` oder ``/etc/mysql/mysql.conf.d/mysqldump.cnf`` im Abschnitt ``[mysqldump]`` um diese Zeilen:

source: For production purposes we recommend to use the tool ``mysqltuner`` to find the perfect setup. You can download the script from github ``https://github.com/major/MySQLTuner-perl`` or install it on Debian or Ubuntu systems via package manager:
de: Für den Produktivbetrieb empfehlen wir die Nutzung des Tools ``mysqltuner``, mit dem Sie die bestmöglichen Einstellungen für Ihr System ermitteln können. Sie können das Skript unter ``https://github.com/major/MySQLTuner-perl`` aus GitHub herunterladen. In Debian- und Ubuntu-Systemen finden Sie es über die Paketverwaltung:

source: After installing execute the script:
de: Ist die Installation abgeschlossen, führen Sie das Skript aus:

source: Step 8: Setup Elasticsearch
de: Schritt 8: Elasticsearch-Cluster aufsetzen

source: OTOBO recommends an active installation of Elasticsearch for quick search. The easiest way is to setup Elasticsearch on the same host as OTOBO and binding it to its default port.
de: Für schnelle Suchen in OTOBO empfehlen wir ein aktives Elasticsearch-Cluster. Am einfachsten setzen Sie Elasticsearch auf dem gleichen Host wie OTOBO auf und lassen es den Standardport nutzen.

source: Elasticsearch installation example based on Ubuntu 18.04 LTS
de: Beispiel für eine Elasticsearch-Installation unter Ubuntu 18.04 LTS

source: Elasticsearch Installation on another Linux distribution
de: Elasticsearch-Installation auf anderen Linux-Distributionen

source: Please follow the installation tutorial found at https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html.
de: Bitte nutzen Sie das Installations-Tutorial unter https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html.

source: Elasticsearch Module Installation
de: Elasticsearch-Modul installieren

source: Additionally, OTOBO requires plugins to be installed into Elasticsearch:
de: Außerdem erfordert OTOBO die Installation von Plugins in Elasticsearch:

source: Elasticsearch Configuration
de: Elasticsearch konfigurieren

source: Elasticsearch has a multitude of configuration options and possibilities.
de: Elasticsearch bietet viele unterschiedliche Konfigurationsoptionen und -möglichkeiten.

source: In order to ensure error-free operation, you should adjust the jvm heap space for larger OTOBO systems. Please adjust the settings in the file ``/etc/elasticsearch/jvm.options``. You should always set the min and max JVM heap size to the same value. For example, to set the heap to 4 GB, set:
de: In größeren OTOBO-Systemen sollten Sie für einen fehlerfreien Betrieb den JVM Heap Space anpassen. Diese Einstellungen finden Sie in der Datei ``/etc/elasticsearch/jvm.options``. Achten Sie darauf, dass Mindest- und Maximalwert für die JVM Heap Size übereinstimmen. Um den Heap auf 4 GB zu setzen, nehmen Sie folgende Einstellung vor:

source: In our tests, a value between 4 and 10 GB for medium-sized installations has proven to be the best.
de: In unseren Tests hat sich ein Wert zwischen 4 und 10 GB für mittlere Systeme als optimal erwiesen.

source: See ``https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html`` for more information.
de: Bitte nutzen Sie das Installations-Tutorial unter ``https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html``.

source: Now you can restart your Elasticsearch server to load the new configuration settings. On most systems you can use the following command to do so:
de: Jetzt können Sie Ihren Elasticsearch-Server neu starten, um die neuen Konfigurationseinstellungen zu laden. Auf den meisten Systemen gelingt dies mit folgendem Befehl:

source: Step 9: Basic System Configuration
de: Schritt 9: Grundlegende Systemkonfiguration

source: Please use the web installer at http://localhost/otobo/installer.pl (replace "localhost" with your OTOBO hostname) to set up your database and basic system settings such as email accounts.
de: Bitte verwenden Sie den Web Installer unter http://localhost/otobo/installer.pl (ersetzen Sie "localhost" durch den Namen Ihres OTOBO-Hosts), um die Datenbank zu konfigurieren und grundlegende Systemeinstellungen wie die der E-Mail-Konten vorzunehmen.

source: Step 10: First Login
de: Schritt 10: Erste Anmeldung

source: Now you are ready to login to your system at http://localhost/otobo/index.pl as user ``root@localhost`` with the password that was generated (see above).
de: Geschafft! Jetzt können Sie sich mit dem zuvor generierten Passwort (s. o.) über http://localhost/otobo/index.pl als Benutzer ``root@localhost`` anmelden.

source: Step 11: Start the OTOBO Daemon
de: Schritt 11: OTOBO Daemon starten

source: OTOBO daemon is responsible for handling any asynchronous and recurring tasks in OTOBO. What has been in cron file definitions previously is now handled by the OTOBO daemon, which is required to operate OTOBO. The daemon also handles all GenericAgent jobs and must be started from the OTOBO user.
de: Der OTOBO Daemon übernimmt asynchrone und wiederkehrende Aufgaben in OTOBO. Was früher in CronFile-Definitionen hinterlegt wurde, wird jetzt durch den OTOBO Daemon erledigt. Er ist deshalb für den OTOBO-Betrieb unerlässlich. Außerdem übernimmt der Daemon alle GenericAgent Jobs. Er muss vom OTOBO-Benutzer gestartet werden.

source: Step 12: Cron jobs for the OTOBO user
de: Schritt 12: CronJobs für den OTOBO-Benutzer

source: There are two default OTOBO cron files in ``/opt/otobo/var/cron/\*.dist``, and their purpose is to make sure that the OTOBO Daemon is running. They need to be be activated by copying them without the ".dist" filename extension.
de: In ``/opt/otobo/var/cron/\*.dist`` liegen standardmäßig zwei OTOBO Cron-Dateien, die sicherstellen sollen, dass der OTOBO Daemon läuft. Aktivieren Sie diese, indem Sie die Dateien ohne die Dateinamenerweiterung ".dist" kopieren.

source: With this step, the basic system setup is finished.
de: Mit diesem Schritt ist die Grundeinrichtung des Systems abgeschlossen.

source: Step 13: Setup Bash Auto-Completion (optional)
de: Schritt 13: Bash Auto-Completion einrichten (optional)

source: All regular OTOBO command line operations happen via the OTOBO console interface. This provides an auto-completion for the bash shell which makes finding the right command and options much easier.
de: Alle regulären Befehlszeilenoptionen in OTOBO werden über die OTOBO-Konsolenschnittstelle ausgeführt. Damit wird eine Autovervollständigung für Eingaben in die Bash-Shell angeboten, die das Finden geeigneter Befehle und Optionen erheblich erleichtert.

source: You can activate the bash auto-completion by installing the package ``bash-completion``. It will automatically detect and load the file ``/opt/otobo/.bash_completion`` for the ``otobo`` user.
de: Zum Aktivieren der Bash Auto-Completion installieren Sie das Paket ``bash-completion``. Damit wird automatisch die Datei ``/opt/otobo/.bash_completion`` für den Benutzer ``otobo`` gesucht und geladen.

source: After restarting your shell, you can just type this command followed by TAB, and it will list all available commands:
de: Sobald Sie Ihre Konsole neu gestartet haben, können Sie dann folgenden Befehl eingeben und durch TAB ergänzen, um alle verfügbaren Befehle anzuzeigen:

source: If you type a few characters of the command name, TAB will show all matching commands. After typing a complete command, all possible options and arguments will be shown by pressing TAB.
de: Geben Sie einige Zeichen und lassen ein TAB folgen, werden alle auf der eingegebenen Zeichenfolge basierenden Befehle angezeigt. Geben Sie einen Befehl vollständig ein und drücken dann TAB, werden alle möglichen Optionen und Argumente angezeigt.

source: If you have problems, you can execute the following line as user ``otobo`` and add it to your ``~/.bashrc`` to execute the commands from the file.
de: Sollten Sie Probleme haben, können Sie folgende Zeile als ``otobo``-Benutzer ausführen und zu Ihrem ``~/.bashrc`` hinzufügen, um die Befehle aus der Datei heraus auszuführen.

source: Step 14: Further Information
de: Schritt 14: Weiterführende Informationen

source: We advise you to read the OTOBO :doc:`performance-tuning` chapter.
de: Wir empfehlen, das Kapitel OTOBO :doc:`performance-tuning` zu lesen.

source: Installing using Docker and Docker Compose
de: Installation mit Docker und Docker Compose

source: With the dockerized OTOBO deployment you can get your personal OTOBO instance up and running within minutes. All of OTOBO´s dependencies are already included in the provided collection of Docker images.
de: Mit der Docker-basierten Installation können Sie Ihre komplette OTOBO-Instanz innerhalb weniger Minuten aufsetzen. Alle Abhängigkeiten sind in den Docker Images bereits enthalten.

source: Service *db*: MariaDB is set up as the default database.
de: Service *db*: Als Standard-Datenbank ist MariaDB integriert.

source: Service *elastic*: Elasticsearch is set up for the OTOBO power search.
de: Service *elastic*: Für die OTOBO-Schnellsuche ist Elasticsearch eingerichtet.

source: Service *redis*: Redis is enabled for fast caching.
de: Service *redis*: Redis sorgt für schnelles Caching.

source: Service *web*: Gazelle is used as fast Perl webserver.
de: Service *web*: Gazelle dient als schneller Perl-Webserver.

source: Service *nginx*: Nginx is used as optional reverse proxy for HTTPS support.
de: Service *nginx*: Als optionaler Reverseproxy für die HTTPS-Unterstützung wird nginx eingesetzt.

source: We think that this setup is the perfect environment for an OTOBO installation.
de: Wir denken: Dieses Setup ist die perfekte Umgebung für eine OTOBO-Installation.

source: Requirements
de: Technische Voraussetzungen

source: The minimal versions of required software, that have been tested, are listed here:
de: Hier sind die bisher getesteten Mindestanforderungen an die verwendete Software aufgeführt:

source: To get the required minimal versions on Ubuntu 18.04 follow the instructions in https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04 and https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04.
de: Um die benötigten Versionen für Ubuntu 18.04 zu installieren, folgen Sie den Anweisungen unter https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04 und https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04.

source: git, Docker, and Docker Compose can be installed with the standard system tools. Here is an example for installation on Ubuntu 20.04:
de: git, Docker und Docker Compose können mit den Standard-Systemtools installiert werden. Ein Beispiel für die Installation unter Ubuntu 20.04:

source: Please check the Git and the Docker documentation for instructions on further setup.
de: Informationen zum weiteren Septup entnehmen Sie bitte der Git- und Docker-Dokumentation.

source: The following instructions assume that all requirements are met, that you have a working Docker environment. We assume here that the user **docker_admin** is used for interacting with Docker. The Docker admin may be either the **root** user of the Docker host or a dedicated user with the required permissions.
de: Wir gehen im Folgenden davon aus, dass alle erforderlichen Softwaremodule installiert sind und eine funktionierende Docker-Umgebung zur Verfügung steht. Außerdem, dass zur Interaktion mit Docker der Benutzer **docker_admin** verwendet wird. Der Docker-Admin kann entweder der **root**-Benutzer des Docker-Host oder ein spezieller Benutzer mit den erforderlichen Berechtigungen sein.

source: 1. Clone the otobo-docker repo
de: 1. OTOBO-Docker-Repo klonen

source: The Docker images will eventually be fetched from the repository https://hub.docker.com. But there are some setup and command files that need to be cloned from the *otobo-docker* Github repository. Make sure that you specify the branch that corresponds to the current version of OTOBO. For example, when *OTOBO 10.0.15* is the current version then please use the branch *rel-10_0*.
de: Die Docker Images werden letztlich aus dem Image Repository https://hub.docker.com heruntergeladen. Einige Einstellungs- und Befehlsdateien müssen jedoch aus dem *otobo-docker*-Github-Repository geklont werden. Achten Sie hierbei darauf, dass der ausgewählte Branch der aktuellsten OTOBO-Version entspricht. Ein Beispiel: Ist *OTOBO 10.0.15* die aktuelle Version, verwenden Sie den Branch *rel-10_0*.

source: The location of the cloned repository does not matter. For these instructions we chose */opt/otobo-docker* as the working dir.
de: Wo das geklonte Repository liegt, spielt keine Rolle. In dieser Anleitung wählen wir */opt/otobo-docker* als Arbeitsverzeichnis.

source: 2. Create an initial *.env* file
de: 2. Initiale *.env*-Datei anlegen

source: The Docker Compose configuration file *.env* is your primary interface for managing your installation of OTOBO. This file must first be created and then be adapted by yourself. In order to simplify the task there are several example files that should be used as starting point. Which sample file it the best fit depends on your use case. In most cases the decision is between *.docker_compose_env_http* and *.docker_compose_env_https*, depending on whether TLS must be supported or not. The other files are for more specialised use cases.
de: In der Docker Compose Konfigurationsdatei *.env* werden die Einstellungen für die OTOBO-Umgebung vorgenommen. Diese Datei muss von Ihnen erstellt und individualisiert werden. Um Ihnen die Aufgabe zu erleichtern, werden zwei Beispieldateien mitausgeliefert, die Sie als Ausgangspunkt verwenden können. Soll per HTTPS auf die OTOBO Webapplikation via HTTPS zugegriffen werden, verwenden Sie bitte *.docker_compose_env_https*. Wir empfehlen, über HTTPS zuzugreifen. Wird kein HTTPS benötigt, verwenden Sie *.docker_compose_env_http* als Ausgangspunkt.

source: The OTOBO web app provides HTTP.
de: Die OTOBO Oberfläche ist über HTTP erreichbar.

source: The OTOBO web app provides HTTPS by runnning Nginx as a reverse proxy webserver.
de: Die OTOBO Oberfläche ist über Nginx als Reverse-Proxy per HTTPS erreichbar.

source: Like *.docker_compose_env_https* but with support for a custom Nginx configuration.
de: Ähnlich zu *.docker_compose_env_https*, aber mit Unterstützung einer individuellen Nginx Konfiguration.

source: Like *.docker_compose_env_https* but with sample setup for single sign on. Note that Kerberos support is still **experimental**.
de: Ähnlich zu *.docker_compose_env_https*, aber mit Beispiel Konfiguration für Single-Sign-On. Bitte beachten Sie, dass die Unterstützung für Kerberos noch **experimentell** ist.

source: .docker_compose_env_http_selenium and .docker_compose_env_https_selenium
de: .docker_compose_env_http_selenium und .docker_compose_env_https_selenium

source: These are used only for development when Selenium testing is activated.
de: Diese werden nur für Entwicklungszwecke genutzt, wenn Selenium Tests aktiviert sind.

source: Use ``ls -a`` for listing the hidden sample files.
de: ``ls -a`` zeigt die ausgeblendete Template-Dateien an.

source: Per default OTOBO is served on the standard ports. Port 443 for HTTPS and port 80 for HTTP. When HTTPS is activated then the OTOBO web application actually still runs with HTTP. HTTPS support is achieved by an additional reverse proxy, which is implemented as a nginx service.
de: In der Grundeinstellung erfolgt die Verbindung zu OTOBO über die Standardports: Port 443 für HTTPS und Port 80 für HTTP. Auch bei aktiviertem HTTPS, läuft die OTOBO Webapplikation via HTTP. Die HTTPS-Unterstützung erfolgt über einen zusätzlichen Reverseproxy, der als nginx-Service vorgeschaltet wird.

source: For the following commands we assume that HTTPS should be supported.
de: Für die folgenden Befehle gehen wir davon aus, dass HTTPS unterstützt werden soll.
