Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: 3. Configure the password for the database admin user
de: 3. Passwort für den Datenbankadministrator konfigurieren

source: Change the following setting inside your *.env* file:
de: Ändern Sie folgenden Wert in der *.env*-Datei:

source: ``OTOBO_DB_ROOT_PASSWORD=<your_secret_password>``
de: ``OTOBO_DB_ROOT_PASSWORD=<Ihr_geheimes_Passwort>``

source: The password for the database admin user may be chosen freely. The database admin user is needed to create the database user **otobo** and the database schema **otobo**. OTOBO will actually use the dedicated database user **otobo**.
de: Das Passwort für den Datenbankadministrator ist frei wählbar. Dieser wird benötigt, um den Datenbankbenutzer **otobo** und das Datenbankschema **otobo** anzulegen.

source: 4. Set up a volume with SSL configuration for the nginx webproxy (optional)
de: 4. Volume mit SSL-Konfiguration für den nginx-Webproxy aufsetzen (optional)

source: This step can be skipped when OTOBO should be available only via HTTP.
de: Dieser Schritt kann entfallen, wenn nur per HTTP auf OTOBO zugegriffen werden soll.

source: nginx needs for SSL encryption a certificate and a private key.
de: nginx erfordert für die SSL-Verschlüsselung ein Zertifikat sowie einen privaten Schlüssel.

source: For testing and development a self-signed certificate can be used. However for productive use you should work with regular registered certificates.
de: Für Testzwecke und beim Entwickeln kann ein selbst signiertes Zertifikat verwendet werden. Grundsätzlich sind jedoch offizielle Zertifikate erforderlich.

source: See e.g. https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04 on how to create self-signed certificates.
de: Mehr dazu, wie Sie ein selbst signiertes Zertifikat erstellen, erfahren Sie z. B. unter https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04.

source: To specify a CA chain with a certificate in nginx, it is necessary to copy the CA chain file with the actual certificate into a file.
de: Um in nginx eine CA-Chain zusammen mit einem Zertifikat anzugeben, muss das CA-Chain-File mit dem eigentlichen Zertifikat in eine Datei kopiert werden.

source: The certificate and the private key are stored in a volume, so that they can be used by nginx later on. In any case the volume needs to be generated manually, and we need to copy the certificate and key to the volume:
de: Das Zertifikat und der private Schlüssel werden in einem Volume hinterlegt, um später von nginx verwendet werden zu können. Legen Sie zunächst das Volume an und kopieren Sie anschließend Zertifikat und Schlüssel hinein:

source: The names of the copied files need to be set in our newly created *.env* file. E.g.
de: Die Namen der kopierten Dateien müssen in die eben angelegte *.env*-Datei eingegeben werden. Beispiel:

source: ``OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/ssl-cert.crt`` and ``OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/ssl-key.key``
de: ``OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/ssl-cert.crt`` und ``OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/ssl-key.key``

source: Please adapt only the name of the files as the path */etc/nginx/ssl/* is hard coded in the Docker image.
de: Bitte passen Sie nur die Dateinamen an. Der Pfad */etc/nginx/ssl/* ist im Docker Image festgeschrieben.

source: 5. Start the Docker containers with Docker Compose
de: 5. Installation mit Docker und Docker Compose

source: Now we start the Docker containers using ``docker-compose``. Per default the Docker images will be fetched from https://hub.docker.com/u/rotheross.
de: Jetzt starten wir die Docker Container mit ``docker-compose``. Standardmäßig werden die Docker Images von https://hub.docker.com/u/rotheross heruntergeladen.

source: To verify that the six required services (five in the case of HTTP only) are actually running, type:
de: Geben Sie folgende Befehle ein, um sicherzustellen, dass die sechs erforderlichen Dienste (fünf, wenn nur HTTP verwendet werden soll) wirklich laufen :

source: 6. Install and start OTOBO
de: 6. OTOBO installieren und starten

source: Run the OTOBO installer at http://yourIPorFQDN/otobo/installer.pl.
de: Führen Sie den OTOBO Installer von http://IhreIPoderFQDN/otobo/installer.pl aus.

source: Please configure OTOBO inside the installer with a new MySQL database. As MySQL database root password please use the password you configured in the variable ``OTOBO_DB_ROOT_PASSWORD`` of your *.env* file. Please leave the value ``db`` for the MySQL hostname untouched.
de: Konfigurieren Sie OTOBO im Installer mit einer neuen MySQL-Datenbank. Geben Sie als Root-Passwort für die MySQL-Datenbank das Passwort ein, das Sie für die Variable ``OTOBO_DB_ROOT_PASSWORD`` in die *.env*-Datei eingegeben haben. Bitte behalten Sie den Wert ``db`` für den MySQL-Hostnamen unverändert bei.

source: **Have fun with OTOBO!**
de: **Viel Vergnügen mit OTOBO!**

source: To change to the OTOBO directory, inside the running container, to work on command line as usual, you can use the following Docker command: ``docker-compose exec web bash``.
de: Um im laufenden Container in das OTOBO-Verzeichnis zu wechseln und wie gewohnt in der Kommandozeile zu arbeiten, können Sie folgenden Docker-Befehl nutzen: ``docker-compose exec web bash``.

source: Additional technical information
de: Ergänzende technische Informationen

source: This section gives some more technical insight into what is happing under the hood.
de: Dieser Abschnitt bietet einige Zusatzinformationen zu den technischen Hintergründen.

source: List of Docker containers
de: Liste der Docker Container

source: OTOBO webserver on internal port 5000.
de: OTOBO-Webserver über den internen Port 5000.

source: OTOBO daemon. The OTOBO daemon is started and periodically checked.
de: OTOBO Daemon. Der OTOBO Daemon wird gestartet und regelmäßig geprüft.

source: Run the database MariaDB on internal port 3306.
de: Betreibt die Datenbank MariaDB über den internen Port 3306.

source: Elasticsearch on the internal ports 9200 and 9300.
de: Elasticsearch über die internen Ports 9200 und 9300.

source: Run Redis as caching service.
de: Betreibt Redis als Caching-Dienst.

source: Optional container otobo_nginx_1
de: Optionaler Container otobo_nginx_1

source: Run nginx as reverse proxy for providing HTTPS support.
de: Setzt nginx als Reverseproxy für HTTPS-Verbindungen ein.

source: Overview over the Docker volumes
de: Übersicht über die Docker Volumes

source: The Docker volumes are created on the host for persistent data. These allow starting and stopping the services without losing data. Keep in mind that containers are temporary and only data in the volumes is permanent.
de: Die Docker Volumes werden auf dem Host erstellt, um persistente Daten darin zu speichern. So können die Dienste ohne Datenverlust gestartet und gestoppt werden. Bedenken Sie, dass Container nur begrenzte Zeit verfügbar sind, Volumes dagegen dauerhaft.

source: contains */opt/otobo* in the container **web** and **daemon**.
de: enthält */opt/otobo* in den Containern **web** and **daemon**.

source: contains */var/lib/mysql* in the container **db**.
de: beinhaltet */var/lib/mysql* im Container *db*.

source: contains */usr/share/elasticsearch/datal* in the container **elastic**.
de: enthält */usr/share/elasticsearch/datal* im Container **elastic**.

source: contains data for the container `redis`.
de: enthält Daten für den Container `redis`.

source: contains the TLS files, certificate and private key, must be initialized manually.
de: enthält die TLS-Dateien, das Zertifikat und den privaten Schlüssel. Muss von Hand initialisiert werden.

source: Docker environment variables
de: Docker-Umgebungsvariablen

source: In the instructions we did only minimal configuration. But the file *.env* allows to set more variables. Here is a short list of the most important environment variables. Note that more environment variables are supported by the base images.
de: Bisher haben wir nur das Nötigste konfiguriert. In der *.env*-Datei können weitere Konfigurationen vorgenommen werden. Im Folgenden finden Sie eine Auswahl der wichtigsten Umgebungsvariablen.

source: **MariaDB settings**
de: **MariaDB Einstellungen**

source: The root password for MariaDB. This setting is required for running the service *db*.
de: Das Root-Passwort für MariaDB. Diese Einstellung wird für den Betrieb des *db* Service benötigt.

source: **Elasticsearch settings**
de: **Elasticsearch Einstellungen**

source: Elasticsearch needs some settings for productive environments. Please read https://www.elastic.co/guide/en/elasticsearch/reference/7.8/docker.html#docker-prod-prerequisites for detailed information.
de: Damit Elasticsearch in Produktivumgebungen optimal läuft, sind einige Einstellungen vorzunehmen. Detaillierte Informationen entnehmen Sie bitte der Elasticsearch-Dokumentation unter https://www.elastic.co/guide/en/elasticsearch/reference/7.8/docker.html#docker-prod-prerequisites.

source: Example setting: *OTOBO_Elasticsearch_ES_JAVA_OPTS=-Xms512m -Xmx512m* Please adjust this value for production env to a value up to 4g.
de: Beispieleinstellung: *OTOBO_Elasticsearch_ES_JAVA_OPTS=-Xms512m -Xmx512m* Bitte setzen Sie diesen Wert in Produktivumgebungen auf einen Wert bis 4g.

source: **Webserver settings**
de: **Webserver Einstellungen**

source: Set in case the HTTP port should deviate from the standard port 80. When HTTPS is enabled, the HTTP port will redirect to HTTPS.
de: Hier sind Angaben nötig, falls der HTTP-Port vom Standardport 80 abweicht. Ist HTTPS aktiv, wird der HTTP-Port auf HTTPS umgeleitet.

source: **Nginx webproxy settings**
de: **Einstellungen für den nginx-Webproxy**

source: These setting are used when HTTPS is enabled.
de: Diese Einstellungen werden angewendet, wenn HTTPS aktiv ist.

source: Set in case the HTTP port should deviate from the standard port 80. Will redirect to HTTPS.
de: Hier sind Angaben nötig, falls der HTTP-Port vom Standardport 80 abweicht.

source: Set in case the HTTPS port should deviate from the standard port 443.
de: Bitte anpassen, falls der HTTPS-Port vom Standardport 443 abweicht.

source: SSL cert for the nginx webproxy. Example: *OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/acme.crt*
de: SSL-Zertifikat für den nginx-Webproxy. Beispiel: *OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/acme.crt*

source: SSL key for the nginx webproxy. Example: *OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/acme.key*
de: SSL-Schlüssel für den nginx-Webproxy. Beispiel: *OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/acme.key*

source: **Nginx webproxy settings for Kerberos**
de: **nginx-Webproxy-Einstellungen für Kerberos**

source: This settings are used by Nginx when Kerberos is used for single sign on.
de: Diese Einstellungen werden von Nginx verwendet, wenn Kerberos für das Single Sign-on eingesetzt wird.

source: Kerberos keytab file. The default is */etc/krb5.keytab*.
de: Kerberos Keytab-Datei. Standard ist */etc/krb5.keytab*.

source: Kerberos config file. The default is */etc/krb5.conf*, usually generated from *krb5.conf.template*
de: Kerberos Config-Datei. Standard ist */etc/krb5.conf*, usually generated from *krb5.conf.template*

source: Kerberos Service Name. It is not clear where this setting is actually used anywhere.
de: Kerberos Service Name. Es ist unklar ob diese Einstellung tatsächlich irgendwo verwendet wird.

source: Kerberos REALM. Used in */etc/krb5.conf*.
de: Kerberos REALM. Verwendet in */etc/krb5.conf*.

source: Kerberos kdc / AD Controller. Used in */etc/krb5.conf*.
de: Kerberos kdc / AD Controller. Verwendet in */etc/krb5.conf*.

source: Kerberos Admin Server. Used in */etc/krb5.conf*.
de: Kerberos Admin Server. Verwendet in */etc/krb5.conf*.

source: Kerberos Default Domain. Used in */etc/krb5.conf*.
de: Kerberos Default Domain. Verwendet in */etc/krb5.conf*.

source: Provide a custom Nginx config template dir. Gives extra flexibility.
de: Angeben eines nginx-Konfigurationsvorlangenverzeichnis. Gewährleistet zusätzliche Flexibilität.

source: **Docker Compose settings**
de: **Docker Compose-Einstellungen**

source: These settings are used by Docker Compose directly.
de: Diese Einstellungen werden direkt von Docker Compose verwendet.

source: The project name is used as the prefix for the volumes and containers. Per default this prefix is set to `otobo`, resulting in container names like `otobo_web_1` and `otobo_db_1`. Change this name when you want to run more then one instance of OTOBO on the same server.
de: Der Projektname wird als Präfix für die Docker Volumes und Container verwendet. Als Standardwert wird `otobo` verwendet, sodass die Container z.B. `otobo_web_1` und `otobo_db_1` heißen. Wenn Sie mehrere OTOBO Instanzen auf dem selben Server betreiben, passen Sie den Projektnamen bitte jeweils individuell an.

source: Separator for the value of COMPOSE_FILE
de: Separator für die Werte im COMPOSE_FILE

source: Use *docker-compose/otobo-base.yml* as the base and add the wanted extension files. E.g *docker-compose/otobo-override-http.yml* or *docker-compose/otobo-override-https.yml*.
de: Verwenden Sie *docker-compose/otobo-base.yml* als Grundlage und ergänzen Sie die erforderlichen Extension Files wie *docker-compose/otobo-override-http.yml* oder *docker-compose/otobo-override-https.yml*.

source: Used for specifying alternative Docker images. Useful for testing local builds or for using updated versions of the images.
de: Werden verwendet, um alternative Docker Images zu deklarieren. Nützlich zum Testen lokaler Builds oder aktuellerer Versionen der Images.

source: Advanced topics
de: Weiterführende Themen

source: Custom configuration of the nginx webproxy
de: Individuelle Konfiguration des nginx-Webproxy

source: The container ``otobo_nginx_1`` provides HTTPS support by running Nginx as a reverse proxy. The Docker image that runs in the container is composed of the official Nginx Docker image, https://hub.docker.com/_/nginx, along with a OTOBO specific configuration of Nginx.
de: Der Container ``otobo_nginx_1`` bietet HTTPS Unterstützung über einen Nginx als Reverse Proxy. Das Docker Image des Containers besteht aus dem offiziellen Nginx Image, https://hub.docker.com/_/nginx, zusammen mit einer OTOBO spezifischen Nginx Konfiguration.

source: For configuring SSL.
de: Um SSL zu konfigurieren.

source: The internally used HTTP host.
de: Der intern benutzte HTTP Hostname.

source: The internally used HTTP port.
de: Der intern benutzte HTTP Port.

source: See step `4.` for how this configuration possibility was used for setting up the SSL certificate.
de: Wie diese Konfigurationsmöglichkeit genutzt werden kann, um ein SSL-Zertifikat zu installieren, lesen Sie in Schritt `4.`.

source: The following approach is only supported in OTOBO 10.0.4 or later.
de: Der im Folgenden beschriebene Ansatz wird erst ab OTOBO 10.0.4 unterstützt.

source: First comes generation of the new volume. In these sample commands, we use the existing template as a starting point.
de: Zuerst muss ein neues Volume erstellt werden. In den Beispielbefehlen benutzen wir das bestehende Template als Ausgangspunkt.

source: Your adapted nginx configuration usually contains the directive **listen**, which declares the ports of the webserver. The internally used ports have changed between OTOBO 10.0.3 and OTOBO 10.0.4. This change must be reflected in the adapted nginx configuration. So for version 10.0.3 or earlier listen to the ports 80 and 443. For OTOBO 10.0.4 listen to the ports 8080 and 8443.
de: Die angepasste nginx-Konfiguration enthält in der Regel die Anweisung **listen**, in der die Ports für den Webserver definiert werden. Die internen Ports haben sich von OTOBO 10.0.3 zu OTOBO 10.0.4 geändert. Diese Veränderung muss in die nginx-Konfiguration übernommen werden. In Version 10.0.3 und früher lauscht OTOBO auf den Ports 80 und 443. In OTOBO 10.0.4 sind es die Ports 8080 und 8443.

source: The changed Docker Compose configuration can be inspected with:
de: Verwenden Sie den folgenden Befehl, um Informationen zur angepassten Docker-Compose-Konfiguration anzuzeigen:

source: Finally, the containers can be started again:
de: Schließlich können Sie die Container wieder starten:

source: See also the section "Using environment variables in nginx configuration (new in 1.19)" in https://hub.docker.com/_/nginx.
de: Weitere Informationen dazu finden Sie auf https://hub.docker.com/_/nginx im Abschnitt zur Verwendung von Umgebungsvariablen in der nginx-Konfiguration ("Using environment variables in nginx configuration (new in 1.19)").

source: **Short Description**
de: **Kurzbeschreibung**

source: */etc/krb5.keytab* is always installation specific and must therefore always be mounted from the host system.
de: */etc/krb5.keytab* ist immer installationsspezifisch und muss daher immer vom Host-System eingehängt werden.

source: **Kerberos SSO Installation Tutorial**
de: **Kerberos SSO Installationsanleitung**

source: Choosing non-standard ports
de: Individuelle Ports definieren

source: Per default the ports 443 and 80 serve HTTPS and HTTP respectively. There can be cases where one or both of these ports are already used by other services. In these cases the default ports can be overridden by specifying `OTOBO_WEB_HTTP_PORT` and `OTOBO_WEB_HTTPS_PORT` in the *.env* file.
de: Standardmäßig nutzt OTOBO die Ports 443 und 80 für HTTPS und HTTP. In manchen Systemen werden dieses Ports jedoch bereits von anderen Diensten verwendet. In diesem Fall können Sie über die Variablen `OTOBO_WEB_HTTP_PORT` und `OTOBO_WEB_HTTPS_PORT` in der *.env*-Datei andere Ports definieren.

source: Skip startup of specific services
de: Startvorgang gewisser Dienste überspringen

source: Of course the same goal can also be achieved by editing the file *docker-compose/otobo-base.yml* and removing the relevant service definitions.
de: Selbstverständlich kann das selbe Ziel auch erreicht werden, indem man die Datei *docker-compose/otobo-base.yml* anpasst und die relevanten Service-Definitionen entfernt.

source: Now we can use *docker-compose* to recreate our container
de: Jetzt können wir *docker-compose* verwenden, um unseren Container neu zu erstellen

source: Customizing the OTOBO Docker image
de: Docker Image individualisieren

source: Installing extra Debian packages is a little bit trickier. One approach is to create a custom *Dockerfile* and use the OTOBO image as the base image. Another approach is to create a modified image directly from a running container. This can be done with the command `docker commit`, https://docs.docker.com/engine/reference/commandline/commit/. A nice writeup of that process is available at https://phoenixnap.com/kb/how-to-commit-changes-to-docker-image.
de: Zusätzliche Debian-Pakete zu installieren ist etwas aufwändiger. Sie können dazu entweder ein individuelles *Dockerfile* auf Grundlage des OTOBO Image erzeugen. Oder Sie erstellen das angepasste Image direkt aus einem laufenden Container heraus. Nutzen Sie dazu den Befehl `docker commit` – mehr dazu unter https://docs.docker.com/engine/reference/commandline/commit/. Eine gute Anleitung mit Beispielen (auf Englisch) finden Sie auch unter https://phoenixnap.com/kb/how-to-commit-changes-to-docker-image.

source: Pull a tagged OTOBO image, if we don't have it yet, and check whether the image already provides fortune cookies:
de: Pullen Sie ein getaggtes OTOBO Image (sofern nicht bereits vorhanden), und prüfen Sie, ob im Image schon Fortune Cookies bereitgestellt werden:

source: Add fortune cookies to a named container running the original OTOBO image. This is done in an interactive session as the user *root*:
de: Ergänzen Sie die Fortune Cookies in einem benannten Container im originalen OTOBO Image. Dazu nutzen wir eine interaktive Session und den User *root*:

source: Create an image from the stopped container and give it a name. Take into account that the default user and entrypoint script must be restored:
de: Erzeugen Sie ein Image auf Basis des gestoppten Containers und vergeben Sie einen Namen. Beachten Sie, dass der Standardbenutzer und das Entrypoint-Skript wiederhergestellt werden müssen:

source: Finally we can doublecheck:
de: Schließlich prüfen wir, ob alles funktioniert hat:

source: The modified image can be specified in your *.env* file and then be used for fun and profit.
de: Das modifizierte Image kann in Ihrer *.env*-Datei angegeben und frei verwendet werden.

source: Building local images
de: Lokale Images erstellen

source: Building Docker images locally is usually only needed during development. Other use cases are when more current base images should be used for an installation or when extra functionality must be added to the images.
de: Lokale Docker Images werden in der Regel nur zur Entwicklung erstellt. Weitere Anwendungsfälle sind z.B. wenn aktuellere Basis Images benötigt werden oder wenn Images um zusätzliche Funktionalität erweitert werden sollen.

source: The Docker files needed for creating Docker images locally are part of the the git repository https://github.com/RotherOSS/otobo:
de: Die zum Erstellen lokaler Docker Images benötigten Dateien finden Sie im Git Repository unter https://github.com/RotherOSS/otobo:

source: The script for the actual creation of the images is *bin/docker/build_docker_images.sh*.
de: Das Script zum Erstellen der Images finden Sie unter *bin/docker/build_docker_images.sh*.

source: The locally built Docker images are tagged as ``local-<OTOBO_VERSION>`` using the version set up the file *RELEASE*.
de: Lokal erstellte Images werden auf Basis der in der Datei *RELEASE* angegebenen Versionsdaten als ``local-<OTOBO_VERSION>`` getaggt.

source: After building the local images, one can return to the *docker-compose* directory. The local images are declared by setting ``OTOBO_IMAGE_OTOBO``, ``OTOBO_IMAGE_OTOBO_ELASTICSEARCH``, ``OTOBO_IMAGE_OTOBO_NGINX`` in *.env*.
de: Nach dem Erstellen der lokalen Images können Sie in das *docker-compose* Verzeichnis zurückkehren. Neu erstellte Images können mit den entsprechenden Vorgaben in ``OTOBO_IMAGE_OTOBO``, ``OTOBO_IMAGE_OTOBO_ELASTICSEARCH``, ``OTOBO_IMAGE_OTOBO_NGINX`` in *.env* ausgewählt werden.

source: Automatic Installation
de: Automatische Installation

source: Instead of going through http://yourIPorFQDN/otobo/installer.pl, one can take a short cut. This is useful for running the test suite on a fresh installation.
de: Anstatt die URL http://yourIPorFQDN/otobo/installer.pl zu verwenden, können Sie auch eine Abkürzung wählen. Diese Möglichkeit eignet sich besonders, um die Testsuite auf einem frisch installierten System laufen zu lassen.

source: ``docker-compose down -v`` will remove all previous setup and data.
de: ``docker-compose down -v`` löscht alle vorhandenen Einstellungen und Daten.

source: List of useful commands
de: Einige nützliche Befehle

source: ``docker system prune -a`` system clean-up (removes all unused images, containers, volumes, networks)
de: ``docker system prune -a`` Systembereinigung (entfernt alle unbenutzten Images, Container, Volumes, Netzwerke)

source: ``docker version`` show version
de: ``docker version`` Version anzeigen

source: ``docker build --tag otobo --file=otobo.web.Dockerfile .`` build an image
de: ``docker build --tag otobo --file=otobo.web.Dockerfile .`` Image erstellen

source: ``docker run --publish 80:5000 otobo`` run the new image
de: ``docker run --publish 80:5000 otobo`` Neues Image ausführen

source: ``docker run -it -v opt_otobo:/opt/otobo otobo bash`` log into the new image
de: ``docker run -it -v opt_otobo:/opt/otobo otobo bash`` Login auf neuem Image
