Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: Backup and Restore
de: Backup und Wiederherstellung

source: OTOBO has built in scripts for backup and restore. Execute the scripts with the option ``-h`` for more information.
de: OTOBO bietet fertige Skripte zum Erstellen und Wiedereinspielen von Backups. Für weitere Informationen führen Sie diese mit der Option ``-h`` aus.

source: To create a new backup, write permission for the destination directory is needed for the user ``otobo``.
de: Der Benutzer ``otobo`` benötigt im Zielverzeichnis Schreibrechte, damit ein neues Backup erstellt werden kann.

source: The output of the script:
de: Die Ausgabe des Skriptes:

source: Restore
de: Wiederherstellen

source: To restore the database make sure that the database ``otobo`` exists and contains no tables.
de: Bevor Sie die Datenbank wiederherstellen, stellen Sie sicher, dass die Datenbank ``otobo``vorhanden ist und keine Tabellen enthält.

source: Considerations for running OTOBO under Docker
de: Sonderfalll: OTOBO und Docker

source: The same scripts can be used with OTOBO running under Docker. However some Docker specific limitation must be considered.
de: Auch für Docker-basierte OTOBO-Umgebungen können die OTOBO-Standardskripte verwendet werden. Beachten Sie jedoch einige Docker-spezifische Besonderheiten.

source: First we need to make sure that the backup files are not created in the file system that is internal to the container. Because in that case all data would be lost when the container is stopped. Therefore the backup directory must be in a volume. For now we only consider the most simple case, where the backup dir is a local dir on the Docker host. The location of the backup dir in the container can be arbitrarily chosen. In this example we choose the local dir ``otobo_backup`` as the location on the host, and ``/otobo_backup`` as the location in the container.
de: Besonders wichtig: Legen Sie die Backupdateien nicht im internen Dateisystem des Containers ab. Wird der Container gestoppt, sind die Daten dort verloren. Stattdessen empfehlen wir das Backup-Verzeichnis in einem Volume anzulegen. Wir betrachten zunächst nur den einfachsten Fall: Als Backup-Verzeichnis wird ein lokales Verzeichnis auf dem Docker-Host verwendet. Innerhalb des Containers kann das Backup-Verzeichnis an beliebiger Stelle angelegt werden. Für dieses Beispiel verwenden wir das lokale Verzeichnis ``otobo_backup`` als Speicherort auf dem Host und ``/otobo_backup`` als Location im Container.

source: First we need to create the volume.
de: Als erstes legen wir das Volume an.

source: For creating the backup we need a running database and the volumes ``otobo_opt_otobo`` and ``otobo_backup``. This means that the webserver and the Daemon may, but don't have to, be stopped.
de: Um das Backup zu erstellen, benötigen wir eine laufende Datenbank und die Volumes ``otobo_opt_otobo`` sowie ``otobo_backup``. Das bedeutet, Webserver und Daemon können, müssen aber nicht gestoppt werden.

source: For restoring the backup we also need to specify which backup should be restored. The placeholder ``<TIMESTAMP>`` is something like ``2020-09-07_09-38``.
de: Um das System aus einem Backup wiederherstellen zu können, müssen wir angeben, welches Backup verwendet werden soll. Der Platzhalter ``<TIMESTAMP>`` steht für einen Wert wie ``2020-09-07_09-38``.

source: Backup and Restore using Docker
de: Backup und Wiederherstellung mit Docker

source: Please read to the chapter :doc:`backup-restore` for basic information about the backup and restore scripts.
de: Bitte lesen Sie die Anleitung Backup und Wiederherstellung :doc:`backup-restore`. Hier finden Sie die grundlegenden Informationen zu den Backup-Skripten.

source: The standard scripts ``backup.pl`` and ``restore.pl`` can also be used with OTOBO running under Docker. However some Docker specific limitations have to be considered.
de: Auch für Docker-basierte OTOBO-Umgebungen können die OTOBO-Standardskripte verwendet werden. Beachten Sie jedoch einige Docker-spezifische Besonderheiten.

source: First, we need to make sure that the backup files are not created in the file system that is internal to a Docker container. Because in that case the created files would be lost when the container is stopped. This means that the backup directory must located within in a volume. For this manual we only consider the most simple case, where the backup directory is a local directory on the Docker host. The location of the backup dir in the container can be arbitrarily chosen. In this example we choose the local dir ``otobo_backup`` as the location on the host and ``/otobo_backup`` as the location in the container.
de: Erstens: Legen Sie die Backupdateien nicht im internen Dateisystem des Containers ab. Wird der Container gestoppt, sind die Daten dort verloren. Stattdessen empfehlen wir das Backup-Verzeichnis in einem Volume anzulegen. Wir betrachten zunächst nur den einfachsten Fall: Als Backup-Verzeichnis wird ein lokales Verzeichnis auf dem Docker-Host verwendet. Innerhalb des Containers kann das Backup-Verzeichnis an beliebiger Stelle angelegt werden. Für dieses Beispiel verwenden wir das lokale Verzeichnis ``otobo_backup`` als Speicherort auf dem Host und ``/otobo_backup`` im Container.

source: Secondly, commands in the Docker container usually run as the user `otobo` with the user id 1000 and the group id 1000. It must be made sure, that this user can write in the backup directory.
de: Zweitens: Innerhalb des Docker-Containers werden Befehle in der Regel vom User `otobo` mit der User-ID 1000 und der Gruppen-ID 1000 ausgeführt. Achten Sie darauf, dass dieser User im Backup-Verzeichnis Schreibrechte hat.

source: For creating the backup we need a running database and the volumes ``otobo_opt_otobo`` and ``otobo_backup``. This means that the webserver and the OTOBO daemon may, but don't have to, be stopped.
de: Um das Backup zu erstellen, benötigen wir eine laufende Datenbank und die Volumes ``otobo_opt_otobo`` sowie ``otobo_backup``. Das bedeutet, Webserver und OTOBO Daemon können, müssen aber nicht, gestoppt werden.

source: To drop an existing otobo database and create a new one you can use the following commands. First, you have to connect to the MySQL CLI of the `db` container.
de: Um eine bestehende otobo Datenbank zu löschen und eine neue zu erstellen können folgende Befehle verwendet werden. Zuerst müssen Sie sich hierzu mit der MySQL CLI des `db` Containers verbinden.

source: As soon as you are connected to the MySQL server, you can drop and recreate the `otobo` database.
de: Sobald man mit dem MySQL Server verbunden ist, kann die `otobo` Datenbank gelöscht und neu erstellt werden.

source: Adapt customer interface with corporate identity
de: Kundenoberfläche an Corporate Identity anpassen

source: In OTOBO it is very easy to adapt the customer area to your own corporate identity. Follow this tutorial step by step and OTOBO will shine in your own design in a short time.
de: In OTOBO ist es sehr einfach, den Kundenbereich an Ihre eigene Corporate Identity anzupassen. Folgen Sie diesem Tutorial Schritt für Schritt und OTOBO wird in Kürze in Ihrem eigenen Design erstrahlen.

source: Currently, it is not so easy to adapt the agent area to one's own CI. Changes in the OTOBO .css files would be necessary here. One exception is the logo on the agent login page and the agent header. The logos can be easily exchanged by copying the logos to the server and then adjusting the options ``AgentLoginLogo`` and ``AgentLogo`` under ``Admin -> System Configuration``.
de: Momentan ist es nicht besonders einfach, den Agentenbereich an seine eigene CI anzupassen. Änderungen der OTOBO .css-Dateien wären hierfür notwendig. Eine Ausnahme ist das Logo der Agenten-Anmeldemaske und im Hauptmenübereich der Agenten. Die Logos können einfach ausgetauscht werden, indem man die Logos auf den Server kopiert und dann die Optionen ``AgentLoginLogo`` und ``AgentLogo`` unter ``Admin -> Systemkonfiguration`` anpasst.

source: Change colors in Customer Area
de: Farben im Kundenbereich anpassen

source: To change the colors for the OTOBO customer interface, please go to ``Admin -> System Configuration`` and change the following settings:
de: Um die Farben für den OTOBO Kundenbereich anzupassen, gehen Sie bitte zu ``Admin -> Systemkonfiguration`` und passen Sie die folgenden Einstellungen an:

source: To change the colours on the Customer Dashboard, please go to `Admin -> System Configuration`` and search for CustomerDashboard. In the search result you will find all the options you need with colour definitions.
de: Um die Farben im Kunden-Dashboard anzupassen, gehen Sie bitte in ``Admin -> Systemkonfiguration`` und suchen Sie nach ``CustomerDashboard``. In den Suchergebnissen finden Sie alle Optionen, die Sie für die Farbdefinitionen benötigen.

source: Change Logos and Pictures
de: Logos und Bilder bearbeiten

source: In the first step please copy your Logos and Pictures to the OTOBO Server. Please use an SCP client (WinSCP) for this purpose. Often you do not have the permissions to copy the logos to the right place. In this case, it is best to use the folder /tmp/.
de: Im ersten Schritt kopieren Sie bitte Ihre Logos und Bilder auf den OTOBO-Server. Bitte verwenden Sie einen SCP-Dienst (bspw. WinSCP) für diesen Zweck. Häufig hat man nicht die Berechtigungen um die Logos an die richtigen Stellen zu kopieren. In diesem Fall ist es am besten, den Ordner /tmp/ zu verwenden.

source: In the next step copy the Logo into the OTOBO Home directory:
de: Im nächsten Schritt kopieren Sie das Logo in das OTOBO Home-Verzeichnis:

source: Now change inside the OTOBO Agent Interface to ``Admin -> System Configuration`` and change the following settings:
de: Nun wechseln Sie im OTOBO Agentenbereich zu ``Admin -> Systemkonfiguration`` und passen Sie folgende Einstellungen an:

source: Change Customer Login Pictures and Text
de: Bilder und Text für den Kundenlogin anpassen

source: 1 and 2 - System Configuration Option **CustomerLogin::Settings**
de: 1 und 2 - Systemkonfigurationseinstellung **CustomerLogin::Settings**

source: **Remove Opacity and Watermark**
de: **Deckkraft und Wasserzeichen entfernen**

source: At the moment it is not possible to remove the overlay and watermark used in the image on the right by system configuration.
de: Im Moment ist es nicht möglich, in der Systemkonfiguration das Overlay und das Wasserzeichen zu entfernen, die im Bild rechts verwendet werden.

source: To remove the opacity, please adjust the option **#oooLoginBG > .oooBG** in the file
de: Um die Deckkraft zu entfernen, passen Sie die Option **#oooLoginBG > .oooBG** in der Datei an

source: To remove the watermark, please remove the following line inside the file:
de: Um das Wasserzeichen zu entfernen, löschen Sie bitte die folgenden Zeilen innerhalb der Datei:

source: Please add the files to a opm package in the next step, so that the changes remain persistent. You can find instructions on how to do this in our Admin Manual: https://doc.otobo.org/manual/developer/10.1/en/content/how-to-publish-otobo-extensions.html
de: Bitte fügen Sie im nächsten Schritt die Dateien zu einem opm-Paket hinzu, sodass die Veränderungen persistent bleiben. Sie finden eine Anleitung, wie das geht, in unserem Admin-Handbuch: https://doc.otobo.org/manual/developer/10.1/de/content/how-to-publish-otobo-extensions.html

source: Change Customer Dashboard tiles and options
de: Anpassen der Kunden-Dashboard-Kacheln und Optionen

source: To change the colours on the Customer Dashboard, please go to ``Admin -> System Configuration`` and search for **CustomerDashboard**.
de: Um die Farben des Kunden-Dashboard anzupassen, wechseln Sie bitte in ``Admin -> Systemkonfiguration`` und suchen Sie nach **CustomerDashboard**.

source: In the search result you will find all the options you need with colour definitions.
de: Im Suchergebnis finden Sie alle Optionen, die für die Farbdefinitionen benötigt werden.

source: 1 - To change the picture, link and text please use the System Configuration Option **CustomerDashboard::Tiles###FeaturedLink-01**
de: 1 - Um das Bild, die Verknüpfung und den Text anzupassen, verwenden Sie bitte die Systemkonfigurationseinstellung **CustomerDashboard::Tiles###FeaturedLink-01**

source: 2 - To change the toplevel text please use the System Configuration Option **CustomerDashboard::Configuration::Text**
de: 2 - Um den oben angezeigten Text anzupassen, verwenden Sie bitte die Systemkonfigurationseinstellung **CustomerDashboard::Configuration::Text**

source: Please disable the config options from not needed tiles.
de: Bitte deaktivieren Sie die Konfigurationsoptionen für nicht benötigte Kacheln.

source: Documentation History
de: Dokumentationshistorie

source: 2020 - OTOBO Installation Tutorial - Rother OSS GmbH (https://otobo.de)
de: 2020 - OTOBO Installationsanleitung - Rother OSS GmbH (https://otobo.de)

source: Published by: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany. Authors: OTRS AG (original version), Rother OSS GmbH (https://otobo.de)
de: Veröffentlicht durch: Rother OSS GmbH (https://rother-oss.com), Oberwalting 31, 94339 Leiblfing, Deutschland. Autoren: OTRS AG (Originalversion), Rother OSS GmbH (Anpassung für OTOBO, https://otobo.de)

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the `GNU website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.
de: Dieses Dokument darf im Rahmen der GNU Free Documentation License in Version 1.3 oder jeder neueren, von der Free Software Foundation veröffentlichten Version, kopiert, verbreitet und/oder verändert werden; ohne unveränderliche Abschnitte, und ohne Umschlagtexte. Den rechtlich bindenden Originaltext der Lizenz finden Sie auf der `GNU-Website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.

source: OTOBO Installation Tutorial
de: OTOBO Installationsanleitung

source: This work is copyrighted by OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.
de: Dieses Dokument unterliegt dem Copyright der OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Deutschland.

source: Copyright © for modifications and amendments 2019-2022 ROTHER OSS GmbH (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany
de: Anpassungen und Ergänzungen unterliegen dem Copyright © der Rother OSS GmbH (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Deutschland.

source: Terms and Conditions OTRS: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the GNU website.
de: Nutzungsbedingungen OTRS: Dieses Dokument darf im Rahmen der GNU Free Documentation License in Version 1.3 oder jeder neueren, von der Free Software Foundation veröffentlichten Version, kopiert, verbreitet und/oder verändert werden; ohne unveränderliche Abschnitte, und ohne Umschlagtexte. Eine Kopie der Lizenz finden Sie auf der GNU-Website.

source: Terms and Conditions Rother OSS: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled "COPYING".
de: Nutzungsbedingungen Rother OSS: Dieses Dokument darf im Rahmen der GNU Free Documentation License in Version 1.3 oder jeder neueren, von der Free Software Foundation veröffentlichten Version kopiert, verbreitet und/oder verändert werden; ohne unveränderliche Abschnitte, und ohne Umschlagtexte. Den rechtlich bindenden Originaltext der Lizenz finden Sie auf der `GNU-Website <https://www.gnu.org/licenses/fdl-1.3.txt>`__, eine Kopie im Abschnitt "COPYING" dieses Dokuments.

source: Published by: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany.
de: Veröffentlicht durch: Rother OSS GmbH, Oberwalting 31, 94339 Leiblfing, Deutschland (https://otobo.de).

source: Authors: OTRS AG (original version), Rother OSS GmbH (https://otobo.de).
de: Autoren: OTRS AG (Originalversion), Rother OSS GmbH (Installationsanleitung OTOBO - https://otobo.de).

source: Contents
de: Inhalt

source: This chapter describes the installation and basic configuration of the central OTOBO framework.
de: Dieses Kapitel beschreibt die Installation und grundlegende Konfiguration des zentralen OTOBO Frameworks.

source: Follow the detailed steps in this chapter to install OTOBO on your server. You can then use its web interface to login and administer the system.
de: Dieses Kapitel führt Sie Schritt für Schritt durch die Installation von OTOBO auf Ihrem Server. Anschließend können Sie sich über die Weboberfläche am System anmelden, um es zu konfigurieren und zu administrieren.

source: As of OTOBO version 10.0.7, we recommend Docker and Docker Compose for the OTOBO installation. By using the provided Docker images, all recommended dependencies (such as Elasticsearch, Redis Cache, etc.) are installed and configured automatically. Updates are thus greatly simplified and the performance has been improved. You can find the instructions for Docker-based installation at https://doc.otobo.org/manual/installation/10.1/en/content/installation-docker.html .
de: Ab der OTOBO-Version 10.0.7 empfehlen wir Docker und Docker Compose für die OTOBO-Installation. Durch die Verwendung unseres Docker-Compose-Images werden alle empfohlenen Abhängigkeiten (wie z. B. Elasticsearch, Redis Cache, etc.) automatisch installiert und konfiguriert. Updates werden dadurch stark vereinfacht und die Performance gesteigert. Die Anleitung für die Docker-basierte Installation finden Sie unter https://doc.otobo.org/manual/installation/10.1/de/content/installation-docker.html.

source: Preparation: Disable SELinux when it is installed and enabled
de: Vorbereitung: Deaktivieren Sie SELinux (sofern aktiv)

source: If your system uses SELinux, you should disable it, otherwise OTOBO will not work correctly.
de: Ist SELinux auf Ihrem System installiert und aktiv, deaktivieren Sie es vor der Installation. Anderenfalls wird OTOBO nicht korrekt funktionieren.

source: Try the command ``sestatus`` and ``getenforce`` when you are not sure whether SELinux is installed and enabled on your system.
de: Wenn Sie nicht sicher sind, ob SELinux installiert und aktiv ist, geben Sie die Befehle ``sestatus`` und ``getenforce`` ein.

source: The ``sestatus`` command returns the SELinux status and the SELinux policy being used. SELinux status: enabled is returned when SELinux is enabled. Current mode: enforcing is returned when SELinux is running in enforcing mode. Policy from config file: targeted is returned when the SELinux targeted policy is used.
de: Der Befehl ``sestatus`` gibt den SELinux-Status aus und informiert darüber, welche SELinux Policy angewendet wird. *SELinux Status*: Ist SELinux aktiv, wird als Status *enabled* angezeigt. *Aktueller Betriebsmodus*: wird hier *enforcing* ausgegeben, läuft SELinux im Enforcing-Modus. *Policy* aus der Config-Datei: wird hier *targeted* ausgegeben, kommt die *Targeted Policy* zum Einsatz.

source: Here's how to disable SELinux for RHEL/CentOS/Fedora.
de: So deaktivieren Sie SELinux unter RHEL/CentOS/Fedora:

source: Configure ``SELINUX=disabled`` in the ``/etc/selinux/config`` file:
de: Wählen Sie in der Datei ``/etc/selinux/config`` die Konfiguration ``SELINUX=disabled``:

source: Reboot your system. After reboot, confirm that the ``getenforce`` command returns *Disabled*:
de: Starten Sie Ihr System neu. Versichern Sie sich nach dem Neustart, dass der Befehl ``getenforce`` *Disabled* zurückgibt:

source: Step 1: Unpack and Install OTOBO
de: Schritt 1: OTOBO entpacken und installieren

source: Download the latest otobo release from https://ftp.otobo.org/pub/otobo/. Unpack the source archive (for example, using ``tar``) into the directory ``/opt/otobo-install``:
de: Laden Sie das neueste OTOBO-Release von https://ftp.otobo.org/pub/otobo/ herunter. Entpacken Sie das Quell-Archiv (zum Beispiel mit ``tar``) in das Verzeichnis ``/opt/otobo-install``:

source: Step 2: Install Additional Programs and Perl Modules
de: Schritt 2: Ergänzende Programme und Perl-Module installieren

source: Use the following script to get an overview of all installed and required CPAN modules and other external dependencies.
de: Verwenden Sie das folgende Skript, um eine Übersicht über alle installierten und erforderlichen CPAN-Module sowie andere externe Abhängigkeiten zu erhalten.

source: On Debian systems you may need to manually install some perl packages:
de: Auf Debian-Systemen müssen Sie möglicherweise einige perl-Pakete manuell installieren:

source: Please note that OTOBO requires a working Perl installation with all *core* modules such as the module ``version``. These modules are not explicitly checked by the script. You may need to install a ``perl-core`` package on some systems like RHEL that do not install the Perl core packages by default.
de: Bitte beachten Sie, dass OTOBO eine funktionierende Perl-Installation mit allen *Core*-Modulen wie dem Modul ``version`` voraussetzt. Diese Module werden nicht explizit vom Skript überprüft. Auf einigen Systemen, wie z. B. RHEL, sind nicht alle *Core*-Pakete standardmäßig installiert. Hier kann es erforderlich sein, ein ``perl-core``-Paket von Hand zu installieren.

source: To install the required and optional packages, you can use either CPAN or the package manager of your Linux distribution.
de: Zur Installation der erforderlichen und optionalen Pakete können Sie wahlweise CPAN oder die Paketverwaltung Ihrer Linux-Distribution verwenden.

source: Execute this command to get an install command to install the missing dependencies:
de: Dieses Kommando gibt einen Installationsbefehl zum Installieren der fehlenden Abhängigkeiten aus:

source: There are a number of optional or alternative modules which can be installed, mostly for more customized versions of OTOBO. Calling CheckModules.pl without any argument will list its full functionality.
de: Es gibt eine Reihe optionaler oder alternativer Module, die insbesondere in individualisierten OTOBO Systemen zum Einsatz kommen. Ein Aufruf von CheckModules.pl ohne jedes Argument gibt Aufschluss über den vollen Funktionsumfang des Systems.

source: Step 3: Create the OTOBO User
de: Schritt 3: OTOBO-Benutzer anlegen

source: Create a dedicated user for OTOBO within its own group:
de: Legen Sie einen dedizierten Benutzer für OTOBO in einer eigenen Gruppe an:

source: Add the user to web server group (if the web server is not running as otobo user):
de: Fügen Sie den Benutzer zur Gruppe *Webserver* hinzu (wenn der Webserver nicht als OTOBO-Benutzer ausgeführt wird):

source: Step 4: Activate the Default Configuration File
de: Schritt 4: Standard-Konfigurationsdatei aktivieren

source: There is an OTOBO configuration file bundled in ``$OTOBO_HOME/Kernel/Config.pm.dist``. You must activate it by copying it without the ``.dist`` file name extension.
de: Die Datei ``$OTOBO_HOME/Kernel/Config.pm.dist`` wird mit OTOBO ausgeliefert. Sie enthält Konfigurationsdaten für OTOBO. Aktivieren Sie die Konfiguration, indem Sie die Datei ohne die Dateinamenerweiterung ``.dist`` kopieren.

source: Step 5: Configure the Apache Web Server
de: Schritt 5: Apache-Webserver konfigurieren
