Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: There are some options available for fine-tuning the search index:
de: Es gibt einige Möglichkeiten, den Suchindex granularer abzustimmen:

source: Defines if archived tickets will be included in the search index (disabled by default). This is advisable to keep the index small on large systems with archived tickets. If this is enabled, archived tickets will be found by full-text searches.
de: Definiert, ob archivierte Tickets in den Suchindex aufgenommen werden (standardmäßig deaktiviert). Empfehlenswert, um den Suchindex in großen Systemen mit vielen archivierten Tickets klein zu halten. Ist die Option aktiviert, werden auch archivierte Tickets über die Volltextsuche gefunden.

source: Basic full-text index settings.
de: Grundlegende Einstellungen für die Volltextsuche.

source: ``Ticket::SearchIndex::Attribute`` Setting
de: Einstellungen ``Ticket::SearchIndex::Attribute``

source: Run the following command in order to generate a new index:
de: Führen Sie folgenden Befehl aus, um einen neuen Index zu generieren:

source: Defines the maximum number of words which will be processed to build up the index. For example only the first 1000 words of an article body are stored in the article search index.
de: Definiert die maximale Anzahl beim Indexaufbau berücksichtigter Worte. Beispiel: Im Artikel-Suchindex werden nur die ersten 1.000 Wörter des Artikel-Body gespeichert.

source: ``WordLengthMin`` and ``WordLengthMax``
de: ``WordLengthMin`` und ``WordLengthMax``

source: Used as word length boundaries. Only words with a length between these two values are stored in the article search index.
de: Werden zur Begrenzung der Wortlänge verwendet. Im Artikel-Sucheindex werden nur Wörter mit einer Länge zwischen diesen beiden Werten gespeichert.

source: Filters based on regular expressions exclude parts of the original text from the full-text index.
de: Filter auf Basis regulärer Ausdrücke schließen Teile des Originaltextes aus dem Volltextindex aus.

source: ``Ticket::SearchIndex::Filters`` Setting
de: Einstellungen ``Ticket::SearchIndex::Filters``

source: There are three default filters defined:
de: Standardmäßig sind drei Filter definiert:

source: The first filter strips out special chars like: , & < > ? " ! * | ; [ ] ( ) + $ ^ =
de: Der erste Filter sortiert Sonderzeichen aus. Zum Beispiel: , & < > ? " ! * | ; [ ] ( ) + $ ^ =

source: The second filter strips out words which begin or end with one of following chars: ' : .
de: Der zweite Filter sortiert Wörter aus, die mit einem der folgenden Zeichen beginnen oder enden: ' : .

source: The third filter strips out words which do not contain a word character: a-z, A-Z, 0-9, _
de: Der dritte Filter sortiert Wörter aus, die keines der folgenden Zeichen enthalten: a-z, A-Z, 0-9, _

source: English stop words for full-text index. These words will be removed from the search index.
de: Englische Stopwörter für den Volltext-Index. Diese Wörter werden aus dem Suchindex entfernt.

source: ``Ticket::SearchIndex::StopWords###en`` Setting
de: ``Ticket::SearchIndex::StopWords###en`` Einstellungen englische Stopwörter

source: There are so-called stop-words defined for some languages. These stop-words will be skipped while creating the search index.
de: Für einige Sprachen sind sogenannte Stopwort-Listen definiert. Diese Worte werden beim Anlegen des Suchindex ausgelassen.

source: If your language is not in the system configuration settings or you want to add more words, you can add them to this setting:
de: Möchten Sie zusätzliche Wörter ergänzen, können Sie diese unter der folgenden Einstellung hinzufügen:

source: Document Search
de: Dokumentensuche

source: OTOBO uses Elasticsearch for its document search functionality. For a good introduction into the concepts, installation and usage of Elasticsearch, please follow the `Getting Started guide <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`__.
de: OTOBO nutzt Elasticsearch für die Dokumentensuche. Eine gute Einführung in die Konzeption, Installation und Nutzung von Elasticsearch bietet der `Elasticsearch Getting Started Guide <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`__.

source: Heap Size
de: Heap-Größe

source: Elasticsearch is written in Java and therefore runs in a Java Virtual Machine (JVM) on any cluster node. Such a JVM uses a part of the memory, called *heap*, which size can be configured in configuration file ``jvm.options``.
de: Elasticsearch ist in Java geschrieben und läuft folglich in einer Java Virtual Machine (JVM) auf jedem Clusterknoten. Eine solche JVM nutzt einen Teil des Speichers, den sogenannten Heap. Seine Größe kann in der Konfigurationsdatei ``jvm.options`` definiert werden.

source: The heap minimum and maximum configurations are by default set to a value of 1 GB and can be modified with the following options:
de: Mindest- und Maximalkonfiguration für den Heap sind standardmäßig auf einen Wert von 1 GB fesgelegt und können wie folgt angepasst werden:

source: ``Xms1g``: minimum heap size.
de: ``Xms1g``: minimale Heapgröße.

source: ``Xmx1g``: maximum heap size.
de: ``Xmx1g``: maximale Heapgröße.

source: If the ``Xms`` has a lower value than ``Xmx``, the JVM will resize the used heap anytime the current limit is exceeded, until the value of ``Xmx`` is reached. Such a resizing causes the service to pause until it is finished, which may decrease the speed and reactivity of the search or indexing actions. Therefore it is highly recommended to set those configurations to an equal value.
de: Liegt der ``Xms``-Wert unter dem für ``Xmx``, passt die JVM den verwendeten Heap bei jeder Überschreitung des aktuellen Limits automatisch an, bis der ``Xmx``-Wert erreicht ist. Bei jeder Anpassung wird der Dienst bis zum Ende pausiert, so dass Schnelligkeit und Reaktivität der Suche und Indexierung beeinträchtig werden können. Wir empfehlen deshalb dringend, beide Parameter auf den gleichen Wert zu setzen.

source: If the maximum heap size is exceeded, the related cluster node stops working and might even shutdown the service.
de: Wird die maximale Heapgröße überschritten, stoppt der zugehörige Clusterknoten die Arbeit und kann den Dienst sogar herunterfahren.

source: The higher the heap maximum value is set, the more memory can be used by Elasticsearch, which also increases the possible pauses for garbage collection, done by the JVM. Therefore it is recommended to set a value for ``Xmx``, that is not higher than 50% of the physical memory.
de: Je höher die maximale Heapgröße, desto mehr Speicher kann Elasticsearch nutzen. Damit steigt auch die Anzahl möglicher Pausen durch die Garbage Collection der JVM. Es wird deshalb empfohlen, den Wert für ``Xmx``auf maximal 50 % des physischen Speichers zu setzen.

source: For more information and good rules of thumb about the heap size, please follow `the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html>`__.
de: Weitere Informationen und gute Richtwerte für die Heapgröße entnehmen Sie bitte `der offiziellen Elasticsearch-Dokumentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html>`__.

source: Disk Allocation
de: Festplattennutzung

source: While running the service, Elasticsearch inspects the available disk space. Based on the result, it decides whether to allocate new shards to a cluster node. In some cases it even relocates shards away from a node. This behavior is determined by the current disk capacity. It can be configured by settings in the configuration file *elasticsearch.yml*. Here are some relevant configuration settings. They come with good default values, but might be important in trouble shooting.
de: Elasticsearch prüft während der Laufzeit den verfügbaren Festplattenplatz. Je nach Auslastung werden Clusterknoten weitere Shards zugewiesen oder sogar abgezogen. Dieses Verhalten wird durch die verfügbare Festplattenkapazität gesteuert und kann in der Konfigurationsdatei *elasticsearch.yml* konfiguriert werden. Hier finden Sie einige wichtige Konfigurationen, für die gute Standardwerte vorgegeben sind, die aber von Bedeutung sein können.

source: Default value of 85%. When this limit is exceeded, Elasticsearch will no longer allocate more shards to the related cluster node. The operation of that node is not influenced and data can still be indexed and searched.
de: Standardwert 85 %. Wird diese Grenze überschritten, weist Elasticsearch dem jeweiligen Clusterknoten keine weiteren Shards zu. Der Betrieb des jeweiligen Knotens wird nicht beeinträchtigt, Daten können weiterhin indexiert und durchsucht werden.

source: Default value of 90%. When this limit is exceeded, Elasticsearch will try to relocate existing shards to other nodes that have enough space available.
de: Standardwert 90 % . Wird dieser Grenzwert überschritten, versucht Elasticsearch vorhandene Shards auf andere Knoten mit ausreichend Platz zu verschieben.

source: Default value of 95%. When this limit is exceeded, Elasticsearch will update the configuration of all indices, that have at least one shard allocated to the related cluster node, to read-only index blocks. Specifically, they are flagged with ``index.blocks.read_only_allow_delete``.
de: Standardwert 95 %. Wird dieser Grenzwert überschritten, aktualisiert Elasticsearch die Konfiguration aller Indizes, von denen mindestens ein Shard dem jeweiligen Clusterknoten zugeordnet ist, auf schreibgeschützte Indexblöcke. Diese werden mit dem Tag ``index.blocks.read_only_allow_delete`` gekennzeichnet.

source: After that update, it is no longer possible to index new data to such indices. The indexes are restricted to searches and to delete actions only.
de: Ab diesem Zeitpunkt ist es nicht mehr möglich, neue Daten zum jeweiligen Index hinzuzufügen. Es können nur noch Such- und Löschvorgänge durchgeführt werden.

source: If the flood stage was exceeded and certain indices are configured to read-only mode, such configuration *will not* automatically be changed by Elasticsearch. If the related disks contain enough free space again due to manual actions, it is needed to change the configuration back to normal mode manually.
de: Wurde der Grenzwert überschritten und sind bestimmte Indizes auf Readonly gesetzt, wird Elasticsearch diese Konfiguration *nicht automatisch* wieder zurücksetzen. Haben Sie also von Hand dafür gesorgt, dass wieder genügend Festplattenspeicher verfügbar ist, müssen Sie die Konfiguration von Hand wieder auf Normalmodus zurücksetzen.

source: For more information about disk watermarks and disk-based shard allocation, please follow `the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/disk-allocator.html>`__.
de: Weitere Informationen Hochwassermarken und der Zuweisung von Festplatten-Shards finden Sie in der `offiziellen Elasticsearch-Dokumentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/disk-allocator.html>`__.

source: Article Storage
de: Artikelspeicher

source: There are two different back end modules for the article storage of phone, email and internal articles. The used article storage can be configured in the setting ``Ticket::Article::Backend::MIMEBase::ArticleStorage``.
de: Es gibt zwei verschiedene Backendmodule für die Speicherung von Telefon-, E-Mail- und internen Artikeln. Der verwendete Artikelspeicher kann in der Systemkonfiguration unter ``Ticket::Article::Backend::MIMEBase::ArticleStorage`` definiert werden.

source: This default module will store attachments in the database. It also works with multiple front end servers, but requires much storage space in the database.
de: Dieses Standardmodul speichert Anhänge in der Datenbank. Es unterstützt auch mehrere Frontend-Server, benötigt jedoch erheblichen Speicherplatz in der Datenbank.

source: Don't use this with large setups.
de: Verwenden Sie dieses Modul nicht für große Systeme.

source: Use this module to store attachments on the local file system. It is fast, but if you have multiple front end servers, you must make sure the file system is shared between the servers. Place it on an NFS share or preferably a SAN or similar solution.
de: Verwenden Sie dieses Modul, um Anhänge im lokalen Dateisystem zu speichern. Das Modul ist schnell. Achten Sie aber in Umgebungen mit mehreren Frontendservern darauf, dass die Server das Dateisystem gemeinsam nutzen. Verwenden Sie eine NFS-Freigabe oder eine ähnliche Lösung.

source: Recommended for large setups.
de: Empfohlen für große Systeme.

source: You can switch from one back end to the other on the fly. You can switch the back end in the system configuration, and then run this command line utility to put the articles from the database onto the file system or the other way around:
de: Sie können direkt von einem Backed zum anderen wechseln. Sie können das Backend in der Systemkonfiguration ändern und dann dieses Kommandozeilentool ausführen, um Artikel aus der Datenbank in ein Dateisystem zu verlagern - und andersherum:

source: You can use the ``--target`` option to specify the target back end.
de: Verwenden Sie die Option ``--target``, um das Ziel-Backend festzulegen.

source: The entire process can take considerable time to run, depending on the number of articles you have and the available CPU power and/or network capacity.
de: Der gesamte Prozess kann je nach Anzahl der vorhandenen Artikel sowie verfügbarer CPU-Leistung und Netzwerkkapazität erhebliche Zeit in Anspruch nehmen.

source: If you want to keep old attachments in the database, you can activate the system configuration option ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` to make sure OTOBO will still find them.
de: Wenn Sie alte Anhänge in der Datenbank behalten möchten, können Sie die Option ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` in der Systemkonfiguration aktivieren, um sicherzustellen, dass OTOBO diese auch weiterhin findet.

source: Archiving Tickets
de: Tickets archivieren

source: As OTOBO can be used as an audit-proof system, deleting closed tickets may not be a good idea. Therefore there is a feature that allows you to archive tickets.
de: Da OTOBO als revisionssicheres System betrieben werden kann, ist das Löschen geschlossener Tickets möglicherweise nicht empfehlenswert. Es gibt deshalb eine Funktionalität zum Archivieren von Tickets.

source: Tickets that match certain criteria can be marked as archived. These tickets are not accessed if you do a regular ticket search or run a generic agent job. The system itself does not have to deal with a huge amount of tickets any longer as only the latest tickets are taken into consideration when using OTOBO. This can result in a huge performance gain on large systems.
de: Tickets, die bestimmten Kriterien entsprechen, können als archiviert markiert werden. Archivierte Tickets bleiben bei der regulären Ticketsuche und beim Ausführen von Generic Agent-Jobs außen vor. So muss das System nicht bei jeder Anfrage enorme Ticketmengen verarbeiten, stattdessen werden im Regelfall nur die neuesten - relevanten - Tickets berücksichtigt. Insbesondere bei großen Systemen kann dies eine erhebliche Leistungssteigerung verursachen.

source: To use the archive feature:
de: So verwenden Sie die Archivierungsfunktion:

source: Activate the ``Ticket::ArchiveSystem`` setting in the system configuration.
de: Aktivieren Sie die Einstellung ``Ticket::ArchiveSystem`` in der Systemkonfiguration.

source: Define a generic agent job:
de: Definieren Sie einen GenericAgent-Job:

source: Click on the *Add Job* button in the *Generic Agent* screen.
de: Klicken Sie in der Maske *GenericAgent* auf die Schaltfläche *Job hinzufügen*.

source: *Job Settings*: provide a name for the archiving job.
de: *Job-Einstellungen*: Geben Sie einen Namen für den Archivierungsauftrag an.

source: *Automatic Execution*: select proper options to schedule this job.
de: *Automatische Ausführung*: Wählen Sie geeignete Parameter zur Planung des Jobs aus.

source: *Select Tickets*: it might be a good idea to only archive those tickets in a closed state that have been closed a few months before.
de: *Tickets selektieren*: Es kann empfehlenswert sein, Tickets erst einige Monate nach dem Schließen zu archivieren.

source: *Update/Add Ticket Attributes*: set the field *Archive selected tickets* to *archive tickets*.
de: *Ticketattribute aktualisieren / hinzufügen*: Setzen Sie das Feld *Ausgewählte Tickets archivieren* auf *Tickets archivieren*.

source: Save the job at the end of the page.
de: Speichern Sie Ihre Einstellungen am Ende der Seite.

source: Click on the *Run this task* link in the overview table to see the affected tickets.
de: Klicken Sie in der Übersichtstabelle auf *Diese Aufgabe ausführen*, um alle betroffenen Tickets anzuzeigen.

source: Click on the *Run Job* button.
de: Klicken Sie auf die Schaltfläche *Diesen Job ausführen*.

source: Up to 5000 tickets can be modified by running this job manually.
de: Durch manuelles Ausführen dieses Jobs können bis zu 5.000 Tickets geändert werden.

source: When you search for tickets, the system default is to search tickets which are not archived.
de: In der Ticketsuche werden archivierte Tickets standardmäßig nicht berücksichtigt.

source: To search for archived tickets:
de: So suchen Sie nach archivierten Tickets:

source: Open the ticket search screen.
de: Öffnen Sie die Ticketsuche.

source: Set *Archive search* to *Unarchived tickets* or *All tickets*.
de: Setzen Sie *Archivsuche* auf *Nicht archivierte Tickets* oder *Alle Tickets*.

source: Perform the search.
de: Führen Sie die Suche aus.

source: A fast cache module is a great help in terms of performance. We recommend to use a Redis Cache server or to create a ramdisk.
de: Ein schnelles Cache-Modul verbessert die Systemleistung erheblich. Wir empfehlen die Verwendung eines Redis Cache Servers oder die Erstellung einer RAM-Disk.

source: Install a Redis Cache Server
de: Redis Cache Server installieren

source: Install Redis Server
de: Redis Server installieren

source: First of all you need to install the newest Redis Server. The easiest way is to `setup Redis <https://redis.io/topics/quickstart>`__ on the same host as OTOBO and binding it to its default port.
de: Installieren Sie zunächst die neueste Version von Redis Server. Am einfachsten ist es, Redis auf dem gleichen Host wie OTOBO `aufzusetzen <https://redis.io/topics/quickstart>`__ und an den Standardport zu binden.

source: Install Perl module Redis or Redis::Fast
de: Redis Perl Modul oder Redis::Fast installieren

source: You can choose which Redis module to use: `Redis` or `Redis::Fast` (which is compatible with `Redis` but **~2x faster**). Please use ``otobo.CheckModules.pl --list`` to choose the right package for you:
de: Es liegt bei Ihnen, welches Redis-Modul Sie nutzen: `Redis` oder `Redis::Fast` (das mit `Redis` vergleichbar aber **~2x schneller** ist). Die Ausgabe des Befehls ``otobo.CheckModules.pl --list`` unterstützt Sie bei der Wahl des passenden Paketes für Ihre Installation:

source: Configure OTOBO for Redis
de: OTOBO für Redis konfigurieren

source: Please use the OTOBO `SysConfig` (Admin -> System Configuration) to configure OTOBO properly:
de: Bitte verwenden Sie die OTOBO `SysConfig` (Administration -> Systemkonfiguration), um OTOBO entsprechend zu konfigurieren:

source: OTOBO caches a lot of temporary data in ``/opt/otobo/var/tmp``. Please make sure that this uses a high performance file system and storage. If you have enough RAM, you can also try to put this directory on a ramdisk like this:
de: OTOBO speichert viele temporäre Daten in ``/opt/otobo/var/tmp``. Stellen Sie sicher, dass für dieses Verzeichnis ein Hochleistungsdateisystem und -speicher eingesetzt wird. Wenn Sie über genügend RAM verfügen, können Sie auch versuchen, dieses Verzeichnis wie folgt auf einer RAM-Disk abzulegen:

source: Add persistent mount point in ``/etc/fstab``.
de: Fügen Sie einen dauerhaften Mountpunkt in ``/etc/fstab/``hinzu.

source: This will be a non-permanent storage that will be lost on server reboot. All your sessions (if you store them in the file system) and your cache data will be lost.
de: Dies ist ein nicht permanenter Speicher, der bei einem Server-Neustart verloren geht. All Ihre Sitzungen (sofern im Dateisystem gespeichert) und Ihr Cache sind dann verloren.

source: Clustering
de: Cluster

source: For very high loads, it can be required to operate OTOBO on a cluster of multiple front end servers. This is a complex task with many pitfalls. We strongly advise to get in touch with our experts before trying to implement this on your own.
de: Bei sehr hohen Lasten kann es erforderlich sein, OTOBO auf einem Cluster aus mehreren Frontendservern zu betreiben. Dieses Szenario ist komplex und birgt viele Fallstricke. Wir empfehlen dringend, sich mit unseren Experten in Verbindung zu setzen, bevor Sie ein solches Projekt alleine umsetzen.

source: Hardware and Software Requirements
de: Hardware- und Software-Anforderungen

source: The OTOBO web application can be installed on Linux and other Unix derivates, e.g. OpenBSD or FreeBSD. Running OTOBO on Microsoft Windows is not supported.
de: OTOBO kann als Webanwendung unter Linux und anderen Unix-Derivaten wie OpenBSD oder FreeBSD installiert werden. Das Ausführen von OTOBO unter Microsoft Windows wird nicht unterstützt.

source: The web application uses a relational database as backend. So, to run OTOBO, you'll need to run at least a web server and a database server. The web server and the database server may be installed either on the same or on different hosts.
de: Die Webanwendung nutzt eine relationale Datenbank als Backend. Um OTOBO ausführen zu können, benötigen Sie also mindestens einen Webserver und einen Datenbankserver. Diese können wahlweise beide auf einem Server oder auf unterschiedlichen Hosts installiert werden.

source: Alternatively, OTOBO can also run under Docker. When running under Docker, the web and the database server are already included in the setup. Support for deployment with Kubernetes is under development.
de: Alternativ kann OTOBO unter Docker ausgeführt werden. In diesem Fall sind Web- und Datenbankserver bereits im Setup enthalten. Die Bereitstellung mit Kubernetes wird derzeit gerade entwickelt.

source: The OTOBO web application requires Perl along with additional Perl modules from CPAN. The modules can be installed either with a Perl package manager or via the package manager of your operating system (rpm, yast, apt-get). There is a console command for checking the module dependencies:
de: OTOBO benötigt Perl mit einigen weiteren CPAN-Modulen. Sie können diese zusätzlichen Perl-Module über eine Perl-Paketverwaltung oder den Paketmanager Ihres Betriebssystems (rpm, yast, apt-get) installieren. Folgender Konsolenbefehl prüft die Modulabhängigkeiten:

source: If some packages are missing, you can get an install command for your operating system by running the script with the ``--list`` option.
de: Falls Pakete fehlen, erhalten Sie einen Installationsbefehl für Ihr Betriebssystem, indem Sie das Skript mit der Option ``--list`` ausführen.

source: The listed commands should then be executed with root privileges.
de: Die aufgeführten Befehle sollten dann mit *Root*-Berechtigungen ausgeführt werden.

source: The output of the module check script shows the installed packages and the version numbers. Missing modules are marked with a comment.
de: In der Ausgabe des Modulprüfungsskripts werden die installierten Pakete und Versionsnummern angezeigt. Fehlende Module sind durch einen Kommentar gekennzeichnet.

source: Hardware Requirements
de: Hardware-Anforderungen
