Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: The cached data and the operational data doesn't have to be migrated. The mail queue should at this point already be empty.
de: Die zwischengespeicherten Daten und die Betriebsdaten müssen nicht migriert werden. Die Mail-Warteschlange sollte zu diesem Zeitpunkt bereits leer sein.

source: Optional Step for Docker: make required data available inside container
de: Optionaler Schritt für Docker: Erforderliche Daten im Container verfügbar machen

source: There are some specifics to be considered when your OTOBO installation is running under Docker. The most relevant: processes running in a Docker container generally cannot access directories outside the container. There is an exception though: directories mounted as volumes into the container can be accessed. Also, note that the MariaDB database running in ``otobo_db_1`` is not directly accessible from outside the container network.
de: Bei der Nutzung von Docker zur OTOBO-Installation sind einige Besonderheiten zu beachten. Die wichtigste: In einem Docker-Container ausgeführte Prozesse können grundsätzlich nicht auf Verzeichnisse außerhalb dieses Containers zugreifen. Einzige Ausnahme: Auf Verzeichnisse, die als Volumes in den Container gemounted werden, kann zugegriffen werden. Auch die in ``otobo_db_1``laufende MariaDB-Datenbank ist von außerhalb des Container-Netzwerks nicht direkt erreichbar.

source: In the sample commands, we assume that the user **docker_admin** is used for interacting with Docker. The Docker admin may be either the **root** user of the Docker host or a dedicated user with the required permissions.
de: Wir gehen im Folgenden davon aus, dass zur Interaktion mit Docker der Benutzer **docker_admin** verwendet wird. Der Docker-Admin kann entweder der **root**-Benutzer des Docker-Host oder ein spezieller Benutzer mit den erforderlichen Berechtigungen sein.

source: Copy */opt/otrs* into the volume *otobo_opt_otobo*
de: */opt/otrs* in das Volume *otobo_opt_otobo* kopieren

source: In this section, we assume that the OTRS home directory */opt/otrs* is available on the Docker host.
de: Wir gehen in diesem Abschnitt davon aus, dass das OTRS Home-Verzeichnis */opt/otrs* auf dem Docker-Host verfügbar ist.

source: There are at least two viable possibilities:
de: Sie haben mindestens zwei Möglichkeiten:

source: copy */opt/otrs* into the existing volume *otobo_opt_otobo*
de: */opt/otrs* in das bestehende Volume *otobo_opt_otobo* kopieren

source: mount */opt/otrs* as an additional volume
de: */opt/otrs* als zusätzliches Volume mounten

source: Let's concentrate on option **a.** here.
de: Konzentrieren wir uns hier auf Option **a.**.

source: First we need to find out where the volume *otobo_opt_otobo* is available on the Docker host.
de: Als erstes müssen wir herausfinden, wo das Volume *otobo_opt_otobo* auf dem Docker-Host bereitsteht.

source: For safe copying, we use ``rsync``. Depending on your Docker setup, the command ``rsync`` might need to be run with ``sudo``.
de: Wir nutzen ``rsync`` für einen sicheren Kopiervorgang. Je nach Dockerumgebung muss ``rsync`` möglicherweise mit ``sudo``-Rechten ausgeführt werden.

source: This copied directory will be available as */opt/otobo/var/tmp/copied_otrs* within the container.
de: Das kopierte Verzeichnis wird im Container als */opt/otobo/var/tmp/copied_otrs* verfügbar sein.

source: Step 5: Perform the Migration!
de: Schritt 5: Migration durchführen!

source: Please use the web migration tool at http://localhost/otobo/migration.pl. Be aware that you might have to replace "localhost" with your OTOBO hostname and you might have to add your non-standard port. The application then guides you through the migration process.
de: Bitte verwenden Sie das Web-Migrationstool, das Sie unter http://localhost/otobo/migration.pl finden (ersetzen Sie "localhost" durch Ihren OTOBO Host und ergänzen Sie ggf. den Port). Der Assistent führt Sie Schritt für Schritt durch den Prozess.

source: Sometimes, a warning is shown that the deactivation of **SecureMode** has not been detected. Please restart the webserver in this case. This forces the webserver to read in the current configuration.
de: Gelegentlich wird eine Warnung angezeigt, dass die Deaktivierung des **SecureMode** nicht erkannt wurde. Bitte starten Sie in diesem Fall den Webserver neu. So wird die aktuelle Konfiguration eingelesen.

source: If OTOBO runs inside a Docker container, keep the default settings *localhost* for the OTRS server and */opt/otobo/var/tmp/copied_otrs* for the OTRS home directory. This is the path of the data that was copied in the optional step.
de: Wird OTOBO in einem Docker Container ausgeführt, behalten Sie die Standardeinstellungen *localhost* für den OTRS-Server und */opt/otobo/var/tmp/copied_otrs* für das OTRS-Home-Verzeichnis bei. Dieser Pfad führt zu den im optionalen Schritt kopierten Daten.

source: The default values for OTRS database user and password are taken from *Kernel/Config.pm* in the OTRS home directory. Change the proposed settings if you are using a dedicated database user for the migration. Also change the settings when you work with a database that was copied into the *otobo_db_1* Docker container.
de: Die Standardwerte für den OTRS-Datenbankbenutzer und dessen Passwort werden der *Kernel/Config.pm* im OTRS-Homeverzeichnis entnommen. Ändern Sie die vorgeschlagenen Einstellungen, wenn Sie einen speziellen Datenbankbenutzer für die Migration verwenden möchten. Passen Sie die Einstellungen auch dann an, wenn Sie mit einer Datenbank arbeiten, die in den *otobo_db_1* Docker Container kopiert wurde.

source: In the Docker case, a database running on the Docker host won't be reachable via ``127.0.0.1`` from within the Docker container. This means that the setting ``127.0.0.1`` won't be valid for the input field ``OTRS Server``. In that case, enter one of the alternative IP-addresses reported by the command ``hostname --all-ip-addresses`` for ``OTRS Server``.
de: Wenn Sie Docker nutzen, kann die Datenbank auf dem Docker-Host nicht über ``127.0.0.1`` erreicht werden. Die Einstellung ``127.0.0.1``ist deshalb kein gültiger Wert für das Eingabefeld ``OTRS Server``. Geben Sie stattdessen eine der alternativen IP-Adressen an, die Sie mit ``hostname --all-ip-addresses`` für ``OTRS Server`` ermittelt haben.

source: When migrating to a new application server, or to a Docker-based installation, quite often the database cannot be accessed from the target installation. This is usually due to the fact that the otobo database user can only connect from the host the database runs on. In order to allow access anyways it is recommended to create a dedicated database user for the migration. E.g. ``CREATE USER 'otrs_migration'@'%' IDENTIFIED BY 'otrs_migration';`` and ``GRANT SELECT, SHOW VIEW ON otrs.* TO 'otrs_migration'@'%';``. This user can be dropped again after the migration: ``DROP USER 'otrs_migration'@'%'``.
de: Häufig kann das System nach der Migration auf einen neuen Anwendungsserver oder nach einer Docker-basierten Installation nicht auf die Datenbank zugreifen. Das liegt meist daran, dass der OTOBO-Datenbanknutzer sich nur von dem Host aus verbinden kann, auf dem auch die Datenbank läuft. Um dennoch Zugriff auf die Datenbank zu gewährleisten, empfehlen wir die Anlage eines speziellen Datenbankbenutzers für die Migration – z. B. ``CREATE USER 'otrs_migration'@'%' IDENTIFIED BY 'otrs_migration';`` und ``GRANT SELECT, SHOW VIEW ON otrs.* TO 'otrs_migration'@'%';``. Dieser Benutzer kann nach der Migration wieder gelöscht werden: ``DROP USER 'otrs_migration'@'%'``.

source: When the migration is complete, please take your time and test the entire system. Once you have decided that the migration was successful and that you want to use OTOBO from now on, start the OTOBO Daemon:
de: Ist die Migration abgeschlossen, nehmen Sie sich bitte Zeit, um das System ausgiebig zu testen. Erst wenn Sie sicher sind, dass die Migration erfolgreich durchgeführt wurde und dass Sie von nun an mit OTOBO arbeiten möchten, starten Sie den OTOBO Daemon:

source: In the Docker case:
de: In der Docker-Umgebung:

source: Step 6: After Successful Migration!
de: Schritt 6: Nach der erfolgreichen Migration!

source: Uninstall ``sshpass`` if you do not need it anymore.
de: Deinstallieren Sie ``sshpass``, wenn Sie es nicht mehr benötigen.

source: Drop the databases and database users dedicated to the migration if you created any.
de: Löschen Sie ggf. speziell für die Migration angelegte Datenbanken und Datenbankbenutzer.

source: Have fun with OTOBO!
de: Viel Vergnügen mit OTOBO!

source: Known Migration Problems
de: Bekannte Probleme bei der Migration

source: 1. Login after migration not possible
de: 1. Anmelden nach der Migration nicht möglich

source: During our migration tests, the browser used for the migration sometimes had problems. After restarting the browser, this problem usually was solved. With Safari it was sometimes necessary to manually delete the old OTRS session.
de: Während unserer Migrationstests kam es gelegentlich zu Problemen mit dem für die Migration verwendeten Browser. Diese waren in der Regel nach einem Browser-Neustart gelöst. In Safari kann es erforderlich sein, die alte OTRS-Sitzung manuell zu löschen.

source: 2. Final page of the migration has a strange layout due to missing CSS files
de: 2. Fehlende CSS-Dateien führen zu Layoutfehlern auf der letzte Seite der Migration

source: This can happen when the setting ScriptAlias has a non-standard value. The migration simply substitutes otrs for otobo. This might lead to the effect that the CSS and JavaScript can no longer be retrieved in OTOBO. When that happens, please check the settings in *Kernel/Config.pm* and revert them to sane values.
de: Kann vorkommen, wenn die Einstellung ScriptAlias keinen Standardwert enthält. Bei der Migration wird lediglich otrs durch otobo ersetzt. Das kann dazu führen, dass OTOBO nicht mehr korrekt auf CSS und JavaScript zugreifen kann. Bitte überprüfen Sie in diesem Fall die Einstellungen in *Kernel/Config.pm* und korrigieren Sie diese auf geeignete Werte.

source: 3. Migration stops due to MySQL errors
de: 3. Migration stoppt aufgrund von MySQL-Fehlern

source: On systems that experienced problems with an upgrade in the past, the migration process may stop due to MySQL errors in the tables *ticket* and *ticket_history*. Usually these errors are NULL values in the source table that are no longer allowed in the target table. These conflicts have to be manually resolved before you can resume the migration.
de: Auf Systemen, bei denen es in der Vergangenheit Probleme mit Upgrades gab, wird der Migrationsprozess unter Umständen wegen MySQL-Fehlern in den Tabellen *ticket* und *ticket_history* unterbrochen. Typischerweise stammen diese Fehler von NULL-Werten in der Quell-Tabelle, die in der Ziel-Tabelle nicht mehr erlaubt sind. Diese Konflikte müssen manuell behoben werden, bevor die Migration fortgesetzt werden kann.

source: As of OTOBO 10.0.12 there is a check in *migration.pl* that checks for NULL values before the data transfer is done. Note, that the resolution still needs to be performed manually.
de: Seit OTOBO 10.0.12 gibt es in *migration.pl* eine Überprüfung auf NULL Werte, bevor die Daten übertragen werden. Bitte beachten Sie, dass die Behebung trotzdem manuell durchgeführt werden muss.

source: 4. Errors in Step 5 when migrating to PostgreSQL
de: 4. Fehler in Schritt 5 bei der Migration zu PostgreSQL

source: It is not clear yet, whether the extended privileges have to be granted in every setup.
de: Es ist bisher nicht geklärt, ob die erweiterten Berechtigungen in jedem Setup gewährt werden müssen.

source: The discussion in https://otobo.de/de/forums/topic/otrs-6-mysql-migration-to-otobo-postgresql/.
de: Die Diskussion in https://otobo.de/de/forums/topic/otrs-6-mysql-migration-to-otobo-postgresql/.

source: 5. Problems with the Deployment the Merged System Configuration
de: 5. Probleme bei der Inbetriebnahme der zusammengeführten System Konfiguration

source: The problem must be alleviated manually by using OTOBO console commands.
de: Das Problem muss manuell mit Hilfe der OTOBO Konsolenbefehle gelöst werden.

source: List the inconsistencies with the command ``bin/otobo.Console.pl Admin::Config::ListInvalid``
de: Auflistung der Inkonsistenzen mit Hilfe des Befehls ``bin/otobo.Console.pl Admin::Config::ListInvalid``

source: Interactively fix the invalid values with ``bin/otobo.Console.pl Admin::Config::FixInvalid``
de: Ungültige Werte können mit Hilfe des Befehls ``bin/otobo.Console.pl Admin::Config::FixInvalid`` interaktiv behoben werden

source: Deploy the collected changes from migration.pl, including the deactivated **SecureMode** with ``bin/otobo.Console.pl Maint::Config::Rebuild``
de: Nehmen Sie die gesammelten Änderungen durch *migration.pl* inklusive des deaktivierten **SecureMode** mit ``bin/otobo.Console.pl Maint::Config::Rebuild`` in Betrieb

source: After these manual steps you should be able to run *migration.pl* again. The migration will continue with the step where the error occurred.
de: Nach diesen manuellen Schritten sollten Sie *migration.pl* erneut ausführen können. Die Migration setzt dann an dem Schritt fort, bei dem der Fehler aufgetreten ist.

source: Step 7: Manual Migration Tasks and Changes
de: Schritt 7: Manuelle Aufgaben und Anpassungen

source: 1. Password policy rules
de: 1. Regeln für die Passwortrichtlinie

source: With OTOBO 10 a new default password policy for agent and customer users is in effect, if local authentication is used. The password policy rules can be changed in the system configuration (``PreferencesGroups###Password`` and ``CustomerPersonalPreference###Password``).
de: Mit OTOBO 10 wurde standardmäßig eine neue Passwortrichtlinie für Agenten und Kundenbenutzer eingeführt, wenn diese sich lokal authentifizieren. Die Regeln der Passwortrichtlinie können Sie in der Systemkonfiguration anpassen (``PreferencesGroups###Password`` und ``CustomerPersonalPreference###Password``).

source: Password Policy Rule
de: Regel Passwortrichtlinie

source: Default
de: Standard

source: Yes
de: Ja

source: 30 days
de: 30 Tage

source: 5 days
de: 5 Tage

source: 2. Under Docker: Manually migrate cron jobs
de: 2. In der Docker-Umgebung: cron-Jobs manuell migrieren

source: In a non-Docker installation of OTOBO, there is at least one cron job which checks the health of the Daemon. Under Docker, this cron job no longer exists. Furthermore, there is no cron daemon running in any of the Docker containers. This means that you have to look for an individual solution for OTRS systems with customer-specific cron jobs (e. g. backing up the database).
de: Wird OTOBO nicht unter Docker installiert, gibt es mindestens einen Cron-Job, der den Zustand des Daemon überprüft. Unter Docker gibt es diesen Cron-Job nicht mehr. Darüber hinaus läuft in keinem der Docker-Container ein Cron-Daemon. Für OTRS-Systeme mit kundenspezifischen Cron-Jobs (z. B. Datenbank-Backups) müssen deshalb individuelle Lösungen gefunden werden.

source: Special topics
de: Spezielle Themen

source: Migration from Oracle to Oracle
de: Migration von Oracle zu Oracle

source: On the OTOBO host a Oracle client and the Perl module ``DBD::Oracle`` must be installed.
de: Auf dem OTOBO Server müssen ein Oracle Client und das Perl Modul ``DBD::Oracle`` installiert sein.

source: When using the Oracle instant client, then the optional SDK is also needed for installing DBD::Oracle.
de: Falls der Oracle Instant Client genutzt wird, ist zusätzlich das optionale SDK nötig, um DBD::Oracle zu installieren.

source: There are many ways of cloning a schema. In the sample commands we use ``expdb`` and ``impdb`` which use Data Pump under the hood.
de: Es gibt viele Wege um ein Schema zu klonen. In den Befehlbeispielen verwenden wir ``expdb`` und ``impdb``, die unter der Haube Data Pump benutzen.

source: The connect strings shown in this documentation refer to the case when both source and target database run in a Docker container. See also https://github.com/bschmalhofer/otobo-ideas/blob/master/oracle.md .
de: Die Verbindungseinstellungen in dieser Dokumentation gehen davon aus, dass die Quell- und Ziel-Datenbank in einem Docker Container laufen. Mehr dazu unter https://github.com/bschmalhofer/otobo-ideas/blob/master/oracle.md.

source: Clear out otobo
de: Stoppen Sie otobo

source: Stop the webserver for otobo, so that the DB connection for otobo is closed.
de: Stoppen Sie den OTOBO Webserver, damit die Verbindung zur otobo Datenbank geschlossen wird.

source: Export the complete OTRS schema.
de: Export des kompletten OTRS Schemas.

source: Import the OTRS schema, renaming the schema to 'otobo'.
de: Import des OTRS Schemas und Umbenennung zu 'otobo'.

source: Adapt the cloned schema otobo
de: Anpassung des geklonten otobo Schemas

source: Start the web server for otobo again
de: Starten Sie den Webserver für otobo wieder

source: Proceed with step 5, that is with running ``migration.pl``.
de: Fahren Sie mit Schritt 5 ``migration.pl`` fort.

source: If migrating to OTOBO version greater or equal 10.1 the script ``/opt/otobo/scripts/DBUpdate-to-10.1.pl`` has to be executed, to create the tables ``stats_report`` & ``data_storage``, which were newly added in version 10.1.
de: Wird auf eine OTOBO-Version migriert, die größer oder gleich 10.1 ist, muss das Skript ``/opt/otobo/scripts/DBUpdate-to-10.1.pl`` ausgeführt werden, um die Tabellen ``stats_report`` & ``data_storage`` zu erstellen, die neu in der Version 10.1 hinzugefügt wurden.

source: Optional Step: Streamlined migration of the database (only for experts and spezial scenarios)
de: Optionaler Schritt: Gestreamlinte Migration der Datenbank (nur für Experten und Spezialszenarien)

source: In the general migration strategy, all data in the database tables is copied row by row from the OTRS database into the OTOBO database. Exporting the data from the OTRS database and importing it into the OTOBO database might save time and is more stable in some circumstances.
de: Bei der allgemeinen Migrationsstrategie werden alle Daten der Datenbanktabellen Zeile für Zeile von der OTRS-Datenbank in die OTOBO-Datenbank kopiert. In manchen Fällen kann ein Export der OTRS-Datenbank und der anschließende Import in die OTOBO-Datenbank schneller und zuverlässiger sein.

source: This variant works for both Docker-based and native installations.
de: Diese Variante funktioniert sowohl bei Docker-basierten als auch bei nativen Installationen.

source: These instructions assume that OTRS is using MySQL as its backend.
de: Diese Anleitung setzt voraus, dass OTRS MySQL als Backend nutzt.

source: First of all, we need a dump of the needed OTRS database tables. Then we need to perform a couple of transformations:
de: Zuerst muss ein Datenbank-Dump der OTRS-Tabellen erstellt werden. Anschließend führen wir ein paar Transformationen durch:

source: convert the character set to *utf8mb4*
de: Konvertierung des Zeichensatzes auf *utf8mb4*

source: rename a couple of tables
de: umbenennen einiger Tabellen

source: shorten some table columns
de: Kürzung bestimmter Tabellenspalten

source: After the transfomation we can overwrite the tables in the OTOBO schema with the transformed data from OTRS. Effectively we need not a single dump file, but several SQL scripts.
de: Nach der Umwandlung können wir die Tabellen im OTOBO-Schema mit den umgewandelten Daten aus OTRS überschreiben. Effektiv benötigen wir keine einzelne Dump-Datei, sondern mehrere SQL-Skripte.

source: When ``mysqldump`` is installed and a connection to the OTRS database is possible, you can create the database dump directly on the Docker host. This case is supported by the script *bin/backup.pl*.
de: Ist ``mysqldump`` installiert und kann eine Verbindung zur OTRS-Datenbank hergestellt werden, können Sie den Datenbankdump direkt auf dem Docker-Host erstellen. Hierzu können Sie das Skript *bin/backup.pl* verwenden.

source: This requires that an OTOBO installation is available on the Docker host.
de: Dies setzt voraus, dass eine OTRS-Installation auf dem Docker-Host verfügbar ist.

source: The script *bin/backup.pl* generates four SQL scripts in a dump directory, e.g. in *2021-04-13_12-13-04* In order to execute the SQL scripts, we need to run the command ``mysql``.
de: Das Script *bin/backup.pl* generiert vier SQL-Dateien in einem Dump-Verzeichnis, z.B. in *2021-04-13_12-13-04*. Um diese SQL-Dateien auszuführen, wird der Kommandozeilenbefehl ``mysql`` genutzt.

source: Docker-based installation:
de: Docker-basierte OTOBO-Installation:

source: For a quick check whether the import worked, you can run the following commands.
de: Nutzen Sie die folgenden Befehlen, um zu überprüfen, ob der Import erfolgreich war.

source: The database is now migrated. This means that during the next step we can skip the database migration. Watch out for the relevant checkbox.
de: Die Datenbank wurde nun migriert. Das bedeutet, dass Sie im nächsten Schritt die Datenbankmigration überspringen können. Beachten Sie hierzu die entsprechende Checkbox.

source: This is a list of performance enhancing techniques for your OTOBO installation. The topics include configuration, coding, memory use, and more.
de: Hier finden Sie eine Reihe von Möglichkeiten, die Leistung Ihrer OTOBO-Installation zu verbessern – z. B. durch Konfiguration, Entwicklung, Speichernutzung, etc.

source: Ticket Index Module
de: Ticket-Indexmodul

source: Ticket index module can be set via system configuration setting ``Ticket::IndexModule``. There are two back end modules building the index for the ticket queue view:
de: Das Ticket-Indexmodul kann in der Systemkonfiguration über die Einstellung ``Ticket::IndexModule`` konfiguriert werden. Zwei Backend-Module bilden den Index für die Ticket-Ansicht nach Queues:

source: This is the default option, which will generate each queue view on the fly from the ticket table. You will not have performance trouble until you have about 60,000 open tickets in your system.
de: Die Standardoption, in der jede Queue-Ansicht zur Laufzeit aus der Tickettabelle generiert wird. Keine Performance-Beeinträchtigungen zu erwarten bis etwa 60.000 offene Tickets im System sind.

source: The most powerful module, should be used when you have above 80,000 open tickets. It uses an extra ``ticket_index`` table, which will be populated with keywords based on ticket data. Use the following command for generating an initial index after switching back ends:
de: Das leistungsstärkste Modul. Empfohlen bei über 80.000 offenen Tickets im System. Das Modul verwendet eine spezielle ``ticket_index``-Tabelle, die auf Basis der Ticketdaten mit Keywords bestückt wird. Verwenden Sie folgenden Befehl, um nach der Umstellung auf ein anderes Backend einen ersten Index zu generieren:

source: Ticket Search Index
de: Ticket-Suchindex

source: OTOBO uses a special search index to perform full-text searches across fields in articles from different communication channels.
de: OTOBO nutzt einen speziellen Suchindex, um felderübergreifende Volltextsuchen in Artikeln aus unterschiedlichen Kommunikationskanälen durchzuführen.

source: To create an initial index, use this command:
de: Verwenden Sie folgenden Befehl, um einen initialen Index zu erstellen:

source: Actual article indexing happens via an OTOBO daemon job in the background. While articles which were just added in the system are marked for indexing immediately, it could happen their index is available only after a few minutes.
de: Die eigentliche Artikelindexierung erfolgt über einen OTOBO Daemon-Job im Hintergrund. Auch wenn neu hinzugefügte Artikel sofort zur Indexierung markiert werden, kann es deshalb sein, dass ihr Index erst nach einigen Minuten zur Verfügung steht.
