Repository: RotherOSS/doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: ``docker run -it -v opt_otobo:/opt/otobo --entrypoint bash otobo`` try that in case entrypoint.sh is broken
de: ``docker run -it -v opt_otobo:/opt/otobo --entrypoint bash otobo`` falls das Skript entrypoint.sh nicht funktioniert

source: ``docker ps`` show running images
de: ``docker ps`` Laufende Images anzeigen

source: ``docker images`` show available images
de: ``docker images`` Verfügbare Images anzeigen

source: ``docker volume ls`` list volumes
de: ``docker volume ls`` Volumes auflisten

source: ``docker volume inspect otobo_opt_otobo`` inspect a volume
de: ``docker volume inspect otobo_opt_otobo`` Informationen über ein Volume ausgeben

source: ``docker volume inspect --format '{{ .Mountpoint }}' otobo_nginx_ssl`` get volume mountpoint
de: ``docker volume inspect --format '{{ .Mountpoint }}' otobo_nginx_ssl`` Volume Mountpoint ausgeben

source: ``docker volume rm tmp_volume`` remove a volume
de: ``docker volume rm tmp_volume`` Volume entfernen

source: ``docker inspect <container>`` inspect a container
de: ``docker inspect <container>`` Informationen zu einem Container anzeigen

source: ``docker exec -it nginx-server nginx -s reload`` reload nginx
de: ``docker exec -it nginx-server nginx -s reload`` nginx-Reload

source: ``docker-compose config`` check and show the configuration
de: ``docker-compose config`` Informationen zur Konfiguration anzeigen

source: ``docker-compose ps`` show the running containers
de: ``docker-compose ps`` Informationen zu laufenden Containern anzeigen

source: ``docker-compose exec nginx nginx -s reload`` reload nginx
de: ``docker-compose exec nginx nginx -s reload`` nginx-Reload

source: Resources
de: Ressourcen

source: **General info and tutorials**
de: **Grundsätzliche Informationen und Tutorials**

source: `Environment <https://vsupalov.com/docker-arg-env-variable-guide/>`_
de: `Umgebung <https://vsupalov.com/docker-arg-env-variable-guide/>`_

source: **Tips and hints**
de: **Tips und Hinweise**

source: `Newer version of Docker Compose on Ubuntu 18.04 LTS <https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04>`_
de: `Neuere Docker-Compose-Version unter Ubuntu 18.04 LTS installieren <https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04>`_

source: `Newer version of Docker on Ubuntu 18.04 LTS <https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04>`_
de: `Neuere Docker-Version unter Ubuntu 18.04 LTS installieren <https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04>`_

source: `Self signed certificate <https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04>`_
de: `Selbstsigniertes Zertifikat erstellen <https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04>`_

source: **Troubleshooting**
de: **Fehlersuche**

source: `Docker cache invalidation <https://stackoverflow.com/questions/34814669/when-does-docker-image-cache-invalidation-occur>`_
de: `Docker Cache Entwertung <https://stackoverflow.com/questions/34814669/when-does-docker-image-cache-invalidation-occur>`_

source: `Using tcpdump <https://rmoff.net/2019/11/29/using-tcpdump-with-docker/>`_
de: `tcpdump verwenden <https://rmoff.net/2019/11/29/using-tcpdump-with-docker/>`_

source: `Inspect failed builds <https://pythonspeed.com/articles/debugging-docker-build/>`_
de: `Informationen zu fehlgeschlagenen Builds <https://pythonspeed.com/articles/debugging-docker-build/>`_

source: Installing Perl Modules from CPAN
de: Perlmodule installieren

source: When there are special requirements then the need for additional Perl modules may arise. Fortunately, Perl has an excellent package repository that can satisfy almost all needs. That repository is called CPAN and is available at https://metacpan.org/.
de: In Systemen mit besonderen Anforderungen kann es nötig sein, weitere Perlmodule zu installieren. Glücklicherweise verfügt Perl über ein exzellentes Paket-Repository, das nahezu alle Anforderungen befriedigt. Sie finden es unter der Bezeichnung CPAN unter https://metacpan.org/.

source: It is recommended to use the command line client ``cpanm`` for installing modules. ``cpanm`` is often already installed on your system. Please see https://metacpan.org/pod/App::cpanminus for what to do when is isn't already available.
de: Es wird empfohlen, CPAN-Module mit dem Befehlszeilenclient ``cpanm`` zu installieren. ``cpanm`` ist auf vielen Systemen bereits installiert. Sollte dies bei Ihnen nicht der Fall sein, finden Sie weitere Informationen unter https://metacpan.org/pod/App::cpanminus.

source: Alternatively, many Perl modules are also available as packages for your operating system. These packages can be installed with your systems regular package manager.
de: Alternativ sind viele Perl-Module auch als Pakete für Ihr Betriebssystem verfügbar. Diese Pakete können über den regulären Paketmanager Ihres Systems installiert werden.

source: Per default ``cpanm`` installs modules into a systemwide location. In this case modules must be installed as the root user. For example, the command
de: Standardmäßig wird das Modul durch ``cpanm`` in einem systemweiten Verzeichnis installiert. In diesem Fall müssen die Module als Root-Benutzer installiert werden. Der Befehl

source: results in:
de: ergibt z. B.:

source: Docker-based installations
de: Docker-basierte OTOBO Installationen

source: The installed Perl modules will also be available after an upgrade of OTOBO. There is the general rule that files added to ``/opt/otobo`` won't be removed by an upgrade.
de: Die installierten Perl-Module sind auch nach einem OTOBO-Upgrade weiterhin verfügbar. Die Grundsatzregel lautet, dass unter ``/opt/otobo`` hinzugefügte Dateien bei einem Upgrade nicht gelöscht werden.

source: Introduction
de: Einleitung

source: OTOBO is an open source ticket request system with many features to manage customer telephone calls and emails. It is distributed under the GNU General Public License (GPL) and is tested on various Linux platforms.
de: OTOBO ist ein Open-Source-Ticketsystem mit umfassenden Funktionalitäten zur Verwaltung von Kundenanrufen und -E-Mails. Es wird unter der GNU General Public License (GPL) vertrieben und wurde auf verschiedenen Linux-Plattformen getestet.

source: About This Manual
de: Über dieses Handbuch

source: This manual is intended for use by system administrators. The chapters describe the installation and updating of the OTOBO software.
de: Diese Anleitung wendet sich an Systemadministratoren und beschreibt das Vorgehen beim Installieren und Aktualisieren von OTOBO.

source: There is no graphical user interface for installation and updating. System administrators have to follow the steps described in the following chapters.
de: Für Installation und Updates steht keine grafische Benutzeroberfläche zur Verfügung. Die folgenden Kapitel führen Sie als Systemadministrator Schritt für Schritt durch die erforderlichen Abläufe.

source: All console commands look like ``username> command-to-execute``. Username indicates the user account of the operating system, which need to use to execute the command. If a command starts with ``root>``, you have to execute the command as a user with root permissions. If a command starts with ``otobo>``, you have to execute the command as the user created for OTOBO.
de: Alle Befehle für die Kommandozeile entsprechen folgendem Aufbau: ``benutzername > auszuführender-befehl``. Der Benutzername gibt an, mit welchem Benutzerkonto auf dem Betriebssystem der Befehl ausgeführt werden soll. Beginnt ein Befehl mit ``root>``, muss dieser von einem Benutzer mit Root-Berechtigungen ausgeführt werden. Beginnt ein Befehl mit ``otobo>``, muss dieser mit dem für OTOBO angelegten Nutzer durchgeführt werden.

source: Do not select ``username>`` when you copy the command and paste it to the shell. Otherwise you will get an error.
de: Achten Sie darauf, ``benutzername>`` nicht mitzumarkieren, wenn Sie den Befehl kopieren und in die Kommandozeile einfügen. Dies würde einen Fehler verursachen.

source: We assume that OTOBO will be installed to the directory ``/opt/otobo``. If you want to install OTOBO to a different location, then you have to change the path in the commands or create a symbolic link to this directory.
de: Wir setzen in dieser Anleitung voraus, dass OTOBO im Verzeichnis ``/opt/otobo`` installiert wird. Möchten Sie OTOBO in einem anderen Vereichnis installieren, ist es notwendig, den Pfad in den Befehlen entsprechend anzupassen oder einen symbolischen Link auf Ihr Zielverzeichnis zu erstellen.

source: Migration from OTRS / ((OTRS)) Community Edition version 6 to OTOBO version 10.1
de: Migration von OTRS / ((OTRS)) Community Edition Version 6 auf OTOBO 10.1

source: Welcome and thank you for choosing OTOBO!
de: Hallo und danke, dass Sie sich für OTOBO entschieden haben!

source: OTRS, ((OTRS)) Community Edition and OTOBO are very comprehensive and flexible in their application. Thus, every migration to OTOBO requires thorough preparation and possibly some rework, too.
de: OTRS, ((OTRS)) Community Edition und OTOBO sind Systeme mit umfassender Funktionalität, die große Flexibilität bieten. Deshalb erfordert jede Migration sorgfältige Vorbereitung und möglicherweise auch Nacharbeiten.

source: Please take your time for the migration and follow these instructions step by step.
de: Bitte nehmen Sie sich deshalb Zeit für die Migration und befolgen Sie die Anleitung Schritt für Schritt.

source: If you have any problem or question, please do not despair. Call our support line, write an email, or post your query in the OTOBO Community forum at https://forum.otobo.org/. We will find a way to help you!
de: Probleme oder Fragen? Kein Grund zu Verzweifeln :) Rufen Sie unsere Support-Hotline an, schreiben Sie uns eine E-Mail oder bitten Sie im OTOBO Community Forum unter https://forum.otobo.org/ um Unterstützung. Wir werden einen Weg finden, Ihnen zu helfen!

source: After the migration the data previously available in OTRS 6 will be available in OTOBO 10. We do not modify any data of the OTRS 6 installation during the migration.
de: Nach der Migration werden alle bisher in OTRS 6 verfügbaren Daten in OTOBO 10 verfügbar sein. Die Daten in Ihrem OTRS-Ursprungssystem werden während der Migration nicht verändert.

source: Overview over the Supported Migration Szenarios
de: Übersicht über die unterstützen Migrationsmöglichkeiten

source: With the OTOBO Migration Interface it is possible to employ the following migration strategies:
de: Mit dem OTOBO Migrationstool können folgende Migrationen durchgeführt werden:

source: The general migration strategy.
de: Die grundsätzliche Migrationsstrategie.

source: This is the regular way to perform a migration. Many different different combinations are supported:
de: Dies ist der reguläre Weg, um eine Migration durchzuführen. Viele weitere Varianten sind möglich:

source: Change server:
de: Wechsel des Servers:

source: Migrate and simultaneously move to a new application server.
de: Eine Migration mit gleichzeitigem Wechsel zu einem neuen Applikationsserver.

source: Separate application and web servers:
de: Trennung von Applikation und Webserver:

source: It's your choice whether you want to run application and database server on the same host or each on a dedictated host. This choice is regardless of the previous setup in OTRS / ((OTRS)) Community Edition.
de: Sie haben die Möglichkeit, den Anwendungs- und Datenbankserver auf einem gemeinsamen oder zwei verschiedenen Servern laufen lassen – unabhängig davon, wie das beim OTRS- / ((OTRS)) Community Edition-Vorgängersystem war.

source: Different databases:
de: Verschiedene Datenbanken:

source: Migrate from any of the supported databases to any other supported database.
de: Sie können von jeder der unterstützten Datenbanken zu einer anderen migrieren.

source: Different operating system:
de: Wechsel des Betriebssystems:

source: Switch from any supported operating system to any other supported operating system.
de: Sie können während der Migration von jedem unterstützten Betriebssystem zu jedem anderen unterstützten Betriebssystem wechseln.

source: Migrate to a Docker-based installation of OTOBO 10.
de: Auch die Migration zu einer Docker-basierten OTOBO 10-Installation ist möglich.

source: A variant of the general strategy where the database migration is streamlined.
de: Eine Variante des allgemeinen Vorgehens, bei der die Datenbankmigration gestreamlint durchgeführt wird.

source: Migration from an Oracle based OTRS 6 installation to an Oracle based OTOBO installation.
de: Migration von einer Oracle-basierten OTRS 6 Installation zu einer Oracle-basierten OTOBO Installation.

source: This is a special case that is not supported by the general migration strategy. This means that a variant of the streamlined strategy must be used.
de: Dies ist ein Sonderfall der nicht durch die grundsätzliche Migrationsstrategie beachtet wird. Dies bedeutet, dass eine Variante der gestreamlinten Strategie verwendet werden muss.

source: All strategies work for both Docker-based and native installations. But for Docker-based installations some peculiarities have to be considered. These peculiarities are handled in the optional steps.
de: Alle Strategien funktionieren sowohl für Docker-basierte als auch für native Installationen. Bei der Docker-basierten Installation gibt es einige Besonderheiten zu beachten. Sie werden in den optionalen Schritten behandelt.

source: It is also feasible to clone the OTRS datase to the OTOBO database server before the actual migration. This can speed up the general migration strategy.
de: Es ist auch möglich, die OTRS Datenbank vor der Migration auf den OTOBO Datenbankserver zu klonen. Auf diese Weise kann die allgemeine Migrationsstrategie beschleunigt werden.

source: Migration Requirements
de: Migrationsvoraussetzungen

source: Basic requirement for a migration is that you already have an ((OTRS)) Community Edition or OTRS 6.0.\* running, and that you want to transfer both configuration and data to OTOBO.
de: Grundvoraussetzung für eine Migration ist, dass Sie bereits eine laufende ((OTRS)) Community Edition oder ein OTRS 6.0.\* haben und dass deren Konfiguration und Daten in OTOBO übernommen werden sollen.

source: You need a running OTOBO installation to start the migration from there!
de: Sie benötigen eine betriebsbereite OTOBO-Installation als Ausgangpunkt für die Migration!

source: This OTOBO installation must contain all OPM packages installed in your OTRS that you want to use in OTOBO, too.
de: Auf dieser OTOBO-Instanz müssen alle OPM-Pakete installiert sein, die Sie bisher in Ihrem OTRS nutzen und künftig in OTOBO nutzen möchten.

source: If you are planning to migrate to another server, then the OTOBO webserver must be able to access the location where your ((OTRS)) Community Edition or OTRS 6.0.* is installed. In most cases, this is the directory */opt/otrs* on the server running OTRS. The read access can be effected via SSH or via file system mounts.
de: Wenn Sie auf einen anderen Server migrieren möchten, muss der OTOBO-Webserver in der Lage sein, auf das Verzeichnis zuzugreifen, in dem die ((OTRS)) Community Edition oder OTRS 6.0.* installiert sind. Meist ist dies das Verzeichnis */opt/otrs* auf dem Server, auf dem das OTRS läuft. Der Lesezugriff erfolgt über SSH oder Dateisystem-Mounts.

source: The *otrs* database must be accessible from the server running OTOBO. Readonly access must be granted for external hosts. If access is not possible, or when the speed of the migration should be optimised, then a dump of the database is sufficient.
de: Die *otrs*-Datenbank muss von dem Server aus erreichbar sein, auf dem OTOBO läuft. Externe Hosts müssen Lesezugriff haben. Wo kein Zugriff möglich ist oder die Migration beschleunigt werden soll, kann auch mit einem Datenbank-Dump gearbeitet werden.

source: If SSH and database access between the servers is not possible, please migrate OTRS to OTOBO on the same server and only then move the new installation.
de: Sind SSH-Kommunikation und Datenbankzugriff von einem Server auf den anderen nicht möglich, migrieren Sie zunächst auf dem alten Server von OTRS zu OTOBO und ziehen die neue Instanz erst nachträglich um.

source: Step 1: Install the new OTOBO System
de: Schritt 1: Neues OTOBO-System installieren

source: Please start with installing a new OTOBO system. Your old OTRS / ((OTRS)) Community Edition installation will be migrated to that new system. We strongly recommend to read the chapter :doc:`installation`. For Docker-based installations we refer to the chapter :doc:`installation-docker`.
de: Bitte beginnen Sie damit, das neue OTOBO-System zu installieren, auf das Sie Ihre OTRS / ((OTRS)) Community Edition anschließend migrieren möchten. Wir empfehlen dazu dringend, das Kapitel :doc:`installation` zu lesen. Installieren Sie Ihr System mit Docker, ist das Kapitel :doc:`installation-docker` relevant für Sie.

source: After finishing the installation please log in as *root@localhost*. Navigate to the OTOBO Admin Area ``Admin -> Packages`` and install all required OTOBO OPM packages.
de: Sobald die Installation abgeschlossen ist, melden Sie sich bitte in OTOBO als *root@localhost* an und öffnen im Admin-Bereich die Paketverwaltung (``Administration -> Paketverwaltung``). Dort können Sie alle benötigten OTOBO OPM-Pakete installieren.

source: The following OPM packages and OTRS "Feature Addons" need NOT and should NOT be installed, as these features are already available in the OTOBO standard:
de: Folgende OPM-Pakete und OTRS-"Feature Addons" müssen und sollten NICHT installiert werden, da ihre Funktionalität bereits im OTOBO-Standard enthalten ist:

source: Step 2: Deactivate ``SecureMode`` on OTOBO
de: Schritt 2: ``SecureMode`` in OTOBO deaktivieren

source: After installing OTOBO, please log in again to the OTOBO Admin Area ``Admin -> System Configuration`` and deactivate the config option ``SecureMode``.
de: Bitte rufen Sie nach Abschluss der Installation erneut den OTOBO-Admin-Bereich auf, navigieren Sie zu ``Administration -> Systemkonfiguration`` und deaktivieren Sie die Konfig-Option ``SecureMode``.

source: Do not forget to actually deploy the changed setting.
de: Bitte vergessen Sie nicht, die geänderte Einstellung anschließend in Betrieb zu nehmen.

source: Step 3: Stop the OTOBO Daemon
de: Schritt 3: OTOBO-Daemon stoppen

source: This is necessary when the OTOBO Daemon is actually running. Stopping the Daemon is different between Docker-based and non-Docker-based installations.
de: Dies ist nötig, wenn der OTOBO Daemon aktuell läuft. Das Vorgehen, um den OTOBO Daemon zu stoppen unterscheidet sich bei Docker-basierten und nicht-Docker-basierten (nativen) Installationen.

source: In the non-Docker case execute the following commands as the user *otobo*:
de: Bei nicht-Docker-basierten Installationen führen Sie die folgenden Befehle als User *otobo* aus:

source: When OTOBO is running in Docker, you just need to stop the service ``daemon``:
de: Läuft OTOBO in Docker, genügt es, den Dienst ``daemon`` zu stoppen:

source: It is recommended to run a backup of the whole OTOBO system at this point. If something goes wrong during migration, you will then not have to repeat the entire installation process, but can instead import the backup for a new migration.
de: Wir empfehlen, an dieser Stelle ein Backup des gesamten OTOBO-Systems zu erstellen. Treten dann während der Migration Probleme auf, müssen Sie nicht den gesamten Installationsprozess erneut durchlaufen, sondern können einfach das Backup importieren und eine neue Migration anstoßen.

source: We advise you to read the OTOBO :doc:`backup-restore` chapter.
de: Hierzu empfehlen wir die Lektüre des Kapitels OTOBO :doc:`backup-restore`.

source: Optional Step: Mount /opt/otrs for Convenient Access
de: Optionaler Schritt: Für leichteren Zugriff /opt/otrs einhängen

source: Often OTOBO should be running on a new server where */opt/otrs* isn't available initially. In these cases the directory */opt/otrs* on the OTRS server can be mounted into the file system of the OTOBO server. When a regular network mount is not possible, then using ``sshfs`` might be an option.
de: In vielen Fällen soll OTOBO auf einem neuen Server laufen, auf dem */opt/otrs* noch nicht zur Verfügung steht. In diesen Fällen kann das */opt/otrs*-Verzeichnis des OTRS-Servers in das Dateisystem auf dem OTOBO-Server eingehängt werden. Falls ein normales Einhängen über das Netzwerk nicht möglich ist, können Sie beispielsweise auf ``sshfs`` zurückgreifen.

source: Optional Step: Install ``sshpass`` and ``rsync`` when */opt/otrs* Should be Copied via ssh
de: Optionaler Schritt: Installieren von ``sshpass`` und ``rsync``, wenn */opt/otrs* über SSH kopiert werden soll

source: This step is only necessary when you want to migrate OTRS from another server and when */opt/otrs* from the remote server hasn't been mounted on the server running OTOBO.
de: Dieser Schritt ist nur dann nötig, wenn Sie OTRS von einem anderen Server migrieren möchten und */opt/otrs* des OTRS-Servers nicht auf dem OTOBO-Server eingehängt wurde.

source: The tools ``sshpass`` and ``rsync`` are needed so that *migration.pl* can copy files via ssh. For installing ``sshpass``, please log in on the server as user ``root`` and execute one of the following commands:
de: Wir verwenden die Tools ``sshpass`` und ``rsync``, um Dateien über eine SSH-Verbindung zu kopieren. Bitte melden Sie sich als ``root``-Benutzer am Server an und führen Sie einen der folgenden Befehle aus:

source: The same thing must be done for *rsync* when it isn't available yet.
de: Gehen Sie analog vor, wenn *rsync* noch nicht verfügbar ist.

source: Step 4: Preparing the OTRS / ((OTRS)) Community Edition system
de: Schritt 4: OTRS / ((OTRS)) Community Edition Quellsystem vorbereiten

source: Be sure to have a valid backup of your OTRS / ((OTRS)) Community Edition system, too. Yes, we do not touch any OTRS data during the migration, but at times a wrong entry is enough to cause trouble.
de: Stellen Sie sicher, dass für Ihr OTRS / ((OTRS)) Community Edition ein aktuelles und vollständiges Backup vorliegt. Selbst wenn die Daten im Quellsystem während der Migration nicht angetastet werden, kann unter Umständen schon ein einziger falscher Eintrag Probleme bereiten.

source: Now we are ready for the migration. First of all we need to make sure that no more tickets are processed and no users log on to OTRS:
de: Damit sind die grundlegenden Voraussetzungen für die Migration geschaffen. Stellen Sie nun sicher, dass keine Tickets mehr bearbeitet werden und sich Benutzer nicht mehr in OTRS anmelden können:

source: Please log in to the OTRS Admin Area ``Admin -> System Maintenance`` and add a new system maintenance slot for a few hours. After that, delete all agent and user sessions (``Admin -> Sessions``) and log out.
de: Rufen Sie im OTRS-Admin-Bereich ``Administration -> Systemwartung`` auf und fügen Sie ein neues Systemwartungs-Zeitfenster über einige Stunden hinzu. Löschen Sie anschließend alle Agenten- und User-Sitzungen (``Administration -> Sitzungsverwaltung``) und melden Sie sich ab.

source: Stop All Relevant Services and the OTRS Daemon
de: Alle relevanten Services und den OTRS Daemon stoppen

source: Please make sure there are no running services or cron jobs.
de: Versichern Sie sich, dass keine Dienste oder Crons Jobs mehr ausgeführt werden.

source: Clear the Caches and the Operational Data
de: Löschen Sie die Caches und die Betriebsdaten
